[
  {
    "courseCode": "AH3206",
    "courseName": "Islam and Modern and Contemporary Art in Southeast Asia",
    "about": "How do we discuss “Islamic art” history within the context of modern and contemporary Southeast Asia? How do we recontextualize the category of “Islamic art” through looking closely at objects and exhibitions from Southeast Asia? Through art historical methods of writing about objects and images, this course discusses how modern and contemporary artworks reveal the complex negotiations between Islam and modernity and the subtle conversations that traverse cultural practices and ethnic identifications. The course will be structured through artworks that also bear traces of Islamic trade and ritual objects as well as artists’ engagement with contemporary issues."
  },
  {
    "courseCode": "AH3550",
    "courseName": "Art History Internship",
    "about": "Internships take place within the National Gallery of Singapore and relevant museums in Singapore and are vetted and approved by the Minor in Art History’s convenor. All internships will focus on an aspect/aspects of art history to be decided by the student in consultation with his/her academic advisor and the museum of choice. The internship must involve the application of subject knowledge and theory in reflection to the work done."
  },
  {
    "courseCode": "DMA1201EC",
    "courseName": "Design Your Own Course",
    "about": "Not Available"
  },
  {
    "courseCode": "DMA1201EU",
    "courseName": "Design Your Own Course",
    "about": "Not Available"
  },
  {
    "courseCode": "DMA1201HY",
    "courseName": "Design Your Own Course",
    "about": "Not Available"
  },
  {
    "courseCode": "DMA1202EC",
    "courseName": "Design Your Own Course",
    "about": "Not Available"
  },
  {
    "courseCode": "DMA1202EU",
    "courseName": "Design Your Own Course",
    "about": "Not Available"
  },
  {
    "courseCode": "DMA1202HY",
    "courseName": "Design Your Own Course",
    "about": "Not Available"
  },
  {
    "courseCode": "DMA1301EC",
    "courseName": "Design Your Own Course",
    "about": "Not Available"
  },
  {
    "courseCode": "DMA1301EU",
    "courseName": "Design Your Own Course",
    "about": "Not Available"
  }
]