[
  {
    "courseCode": "EC5305",
    "courseName": "Computational Methods in Economics",
    "about": "This module introduces students to numerical methods in economics commonly used to simulate and solve models in the fields of macroeconomics, international trade, finance, and industrial organization. The first half of the module focuses on learning the basic tools of numerical analysis including optimization, approximation, non-linear equations, numerical differentiation/integration and parallel computation. The second half of the module applies these tools to solving dynamic equilibrium models that are widely adopted for quantitativeapplied research in macroeconomics. No prior experience in coding is required, and this module aims at facilitating students’ own development in MATLAB/FORTRAN programming."
  },
  {
    "courseCode": "EC5314",
    "courseName": "Time Series Analysis",
    "about": "The main objective of this course is to provide a rigorous training in univariate and multivariate time series analysis. Univariate techniques are mainly used for forecasting and multivariate techniques are used for both forecasting and policy analyses. Starting with simple ARMA and GARCH models the course moves on to more advanced topics involving non-stationary multivariate processes. Students will learn to use Monte Carlo techniques as well as a lot of practical applications."
  },
  {
    "courseCode": "EC5314R",
    "courseName": "Time Series Analysis",
    "about": "The main objective of this course is to provide a rigorous training in univariate and multivariate time series analysis. Univariate techniques are mainly used for forecasting and multivariate techniques are used for both forecasting and policy analyses. Starting with simple ARMA and GARCH models the course moves on to more advanced topics involving non-stationary multivariate processes. Students will learn to use Monte Carlo techniques as well as a lot of practical applications."
  },
  {
    "courseCode": "EC5319",
    "courseName": "Experimental Economics",
    "about": "This course introduces students to the basic research methodologies in Experimental Economics. The course also provides a survey of the most significant results obtained in Economics from human experiments. Students will learn all facets of conducting experimental research from problem formulation to experimental design to the conducting of pilot experiments. The structure of the course includes seminars, laboratory participation, and a student project."
  },
  {
    "courseCode": "EC5319R",
    "courseName": "Experimental Economics",
    "about": "This course introduces students to the basic research methodologies in Experimental Economics. The course also provides a survey of the most significant results obtained in Economics from human experiments. Students will learn all facets of conducting experimental research from problem formulation to experimental design to the conducting of pilot experiments. The structure of the course includes seminars, laboratory participation, and a student project."
  },
  {
    "courseCode": "EC5322",
    "courseName": "Industrial Organisation",
    "about": "The purpose of this course is to make in-depth analysis and understand various theoretical issues of modern industrial organisation. The approach of this course is game theoretic. In the beginning, basic concepts of non-cooperative game theory are reviewed in detail. This lays the foundation to study various applications of game theoretic models in the field of industrial organisation. The course is aimed for Masters' students and researchers in Economics interested in the area of Industrial Organisation."
  },
  {
    "courseCode": "EC5322R",
    "courseName": "Industrial Organisation",
    "about": "Industrial Organisation"
  },
  {
    "courseCode": "EC5323",
    "courseName": "Text Analysis for Economists",
    "about": "An ever-increasing share of human communication is recorded as digital text. Making sense of this vast amount of data is increasingly important for research in social sciences. This course provides an introduction to text analysis by surveying methods for systematically extracting quantitative information from text, from dictionary-based methods to classification methods, topic models, word embeddings, transformers, and large language models. The course introduces the theoretical foundations for text analysis and illustrates the methods through state-of-the-art applications to research questions in economics and finance. Lectures will be complemented with hands-on exercises working with text data in Python. (96 words)"
  },
  {
    "courseCode": "EC5323R",
    "courseName": "Text Analysis for Economists",
    "about": "An ever-increasing share of human communication is recorded as digital text. Making sense of this vast amount of data is increasingly important for research in social sciences. This course provides an introduction to text analysis by surveying methods for systematically extracting quantitative information from text, from dictionary-based methods to classification methods, topic models, word embeddings, transformers, and large language models. The course introduces the theoretical foundations for text analysis and illustrates the methods through state-of-the-art applications to research questions in economics and finance. Lectures will be complemented with hands-on exercises working with text data in Python. (96 words)"
  },
  {
    "courseCode": "EC5324",
    "courseName": "Cost-Benefit Analysis",
    "about": "This is a standard graduate course on Cost-Benefit Analysis. The Welfare Foundations of Cost-Benefit Analysis are emphasised throughout the course. Topics include investment criteria in the public sector; risk and uncertainty; valuing costs and benefits when prices change; problems of distribution; shadow pricing; externalities and public goods; and the social rate of discount. In addition, students are expected to use Cost-Benefit Analysis in a number of case-studies."
  }
]