[
  {
    "courseCode": "GEC1031",
    "courseName": "Whatever it takes? Making War on Civilians",
    "about": "This course seeks to analyse why killing ‘unarmed civilians’ has been so commonplace in war, across time and space. Why were defenceless unarmed people killed by armed forces? The word now used to define this theme is ‘non-combatant.’ But neither word nor concept is primordial, or was universal. The notion that some types of people should not be targets for military operations did not spring from our consciousness, or from any abstract sense of ethics or morality. It evolved historically, and not in any straight line. This course will ask the direct questions: how, why and to what ends?"
  },
  {
    "courseCode": "GEC1037",
    "courseName": "Big Picture History",
    "about": "This course discusses ‘big picture’ History by considering defined themes that range across time and space. The focus is not on individual societies or time periods, but on questions related to commonalities in developments across all societies. This approach is like looking at a painting from a distance instead of at the brush strokes that constitute it, and will lead to questions about what human activities and experiences constitute the global experience. As part of the Thinking and Expression pillar, this course will help students think historically and also critically engage the maxim that ‘the past is a foreign country.’"
  },
  {
    "courseCode": "GEC1043",
    "courseName": "Feasting and Fasting: Global Histories of Food",
    "about": "This course is intended to whet students’ appetites for a gustatory exploration of the past. We will consider various historical exchanges of ingredients across the globe, the refinement of techniques of culinary preparation, rituals of consumption, table manners and cutlery as well as the cultural significance of acts of feasting or fasting. Various religious, medical and cultural dietary regulations and taboos will be examined, along with the rise of sumptuary rules and connoisseurial practices, and the development of ‘dining out’. Finally we will analyse the role of food in the formation of various identities: nation, gender, class, diaspora."
  },
  {
    "courseCode": "GEC1050",
    "courseName": "Skyscapes: Cultural Interpretations of the Sky",
    "about": "This course traces how the sky has shaped cultures from across the world and in different times. We will explore how skywatching has provided answers to fundamental questions, such as the origins of life and the world, how society should be organised, and how our lives should be led. We will consider perspectives from Indigenous, European and Asian cosmologies, and discuss practices of prediction including astrology and meteorology. We will ponder the implications of technology that is now reshaping our sky. You will have the opportunity to reconnect with the sky and to discuss what the skies mean to you."
  },
  {
    "courseCode": "GEC1051",
    "courseName": "Merchants, Guns and Money: The Economics of War",
    "about": "This course examines the relationship between economics and war. Armed conflict has always required the deep involvement of profit-seeking actors: mercenaries, merchants, trading companies, banks, corporations, and contractors. In turn, innovation and infrastructural development have instigated new methods of warfare. By examining the intersection of military and economic forces from around the world, from the early modern era to the present day, the course explores how the exigences of war have shaped the emergence of the nation-state, the development of capitalism, and the creation of global labor markets."
  },
  {
    "courseCode": "GEC1052",
    "courseName": "From Traveller to Tourist",
    "about": "This course offers a broad survey of the evolution of travel and tourism, delving into its historical foundations and contemporary complexities. Students will examine the history of travel and exploration and its impact on cultural exchange, empire-building, economic development, and global connectivity. Students will trace the historical roots of the booming travel and tourism industry, and be introduced to contemporary issues related to travel consumerism, sustainability, and the influence of technology and social media. Students will develop an understanding of the multifaceted nature of travel and tourism within the broader historical and contemporary context of societal, cultural, and environmental dynamics."
  },
  {
    "courseCode": "GEC1053",
    "courseName": "Rome and the Genealogy of Urban Life",
    "about": "When Rome grew into an empire, the city transformed itself into the capital of the known world. It was the first – and until London in the early 19th century – the only Western city to reach a population of a million. Rome reflected the grandeur and diversity of its empire. It was a cosmopolitan, multi-lingual, and multi-ethnic mega-city, which showcased Roman might, organizational efficiency, and cultural wealth through public works, monumental architecture, and a consumer culture. Studying Rome offers insights into the genealogy of Western urbanism and statecraft, because the city and its empire became paradigmatic in Western Eurasia."
  },
  {
    "courseCode": "GEH1002",
    "courseName": "Economic Issues in Dev World",
    "about": "This course highlights the major economic problems characterising the developing countries, with focus on Southeast Asia and East Asia. Cross-thematic development problems and policy responses are analysed in a non-technical fashion with appropriate policy illustrations. The course also examines the impact of globalization and the ongoing technological disruptions on developing countries and the need for them to remain prepared to gain maximum out of these technologies. Upon course completion, students should have up-to-date knowledge about the Asian development experiences and their leading role in the global economy. They will also get ring-side view of the Singapore development experiences."
  },
  {
    "courseCode": "GEH1013",
    "courseName": "Pirates, Oceans and the Maritime World",
    "about": "Piracy, understood broadly as violence or crime at sea, is a present day phenomenon and yet one which has a history spanning centuries and across all the oceans of the world. From pirates to privateers, corsairs to raiders, maritime predators take various names and forms. This course explores the history of pirates and piracy. By examining case studies from the 1400s onwards and by placing pirates into the context of oceanic history and maritime studies, students will be able to demystify the popular images often associated with pirates."
  },
  {
    "courseCode": "GEH1067",
    "courseName": "Superhero Entertainments",
    "about": "This course examines the social and cultural significance of superhero entertainments. Particular attention is paid to the origins of superheroes in comic books and the manner in which the major two companies, DC and Marvel, positioned those heroes in blockbuster movies commencing with Superman in 1978. The course traces the antecedents of comic book superheroes, discuss their various incarnations in other media forms like radio and television, and culminates in a discussion of the wave of recent superhero films. The course will also cover some of the strategies companies have adopted in licensing and marketing their superheroes."
  }
]