[
  {
    "courseCode": "GES1012",
    "courseName": "Popular Culture in Singapore",
    "about": "This course is designed for both History and non-History students to explore the development and evolution of popular culture in Singapore from the colonial period to the present day. Students will learn diverse topics including Singapore's changing religious landscape, wedding and death rituals, as well as varied forms of popular entertainment from street opera, amusement parks to radio and cinema. Students should expect to gain a sensitivity to change and continuities within historical contexts, to better understand Singapore’s rich cultural heritage and to hone their skills in critical thinking, writing and presentation."
  },
  {
    "courseCode": "GES1037",
    "courseName": "A History of Singapore in Ten Objects",
    "about": "This course facilitates an introductory inquiry into Singaporean pasts based on a cache of 'objects', broadly defined. Students will be invited to make critical observations and bring to bear their imaginations on a variety of 'objects' from Singapore’s pasts: sand, well, club, movie and sound card, among others. Students will then exercise their historical imaginations to generate interpretive possibilities pertaining to Singapore's past prompted by these objects, both individually and collectively. In reflecting on these objects and their possible connections to the past, students will emerge from this course with a broad, diverse, creative and concrete grasp of Singapore's histories."
  },
  {
    "courseCode": "GESS1000",
    "courseName": "Global EC Dimensions of Singapore",
    "about": "This course will introduce students to the dynamics of the world economy and the impact on Singapore in the last two centuries. It will demonstrate how Singapore grew through continual dependence on the rest of the world in different ways by focusing on major labour, capital and technological factors, in which threats are also seen as opportunities."
  },
  {
    "courseCode": "GESS1007",
    "courseName": "Singapore’s Business History",
    "about": "This course traces the business history of Singapore from its origins as an East India Company outpost, as an entrepot for regional and international trade routes to its current status as a global city and center for international finance and business. This course offers an introduction to business history and explores different case studies in the local context. These care studies range from 'rags to riches' stories of early migrant communities, popular local brands, and present day entrepreneurs. Major topics include: trading communities, commodities, networks and migration, entrepreneurship, business culture, heritage, globalization, state, politics and business."
  },
  {
    "courseCode": "GESS1008",
    "courseName": "Nation-Building in Singapore",
    "about": "This course is about Singapore's emergence from British colonial rule and merger with Malaysia to independence and nation-building. It covers political events, the economy, education, national service, ethnic relations, and culture and national identity. Students are encouraged to think through issues central to these topics. The course is tailored for students in all Faculties at all levels."
  },
  {
    "courseCode": "GESS1009",
    "courseName": "The Evolution of a Global City-State",
    "about": "The history of Singapore has traditionally been conceived along internal lines, based mainly, if not solely, on the traditional trajectories of administrative, political and national historical narratives. Yet, as we all know, the evolution of Singapore, from classical regional emporium to international port city and strategic naval base, has all along been defined by much larger regional and international forces. After its emergence as a sovereign state in 1965, Singapore continues to project itself as a 'global city-state'. Our local society has an 'international' make-up, being the product as it were of historical and current diasporic trends. This course provides an international framework for a study of the history of Singapore, and seeks to examine the historical evolution of Singapore against the contexts of regional and international changes and developments from the 14th to the 20th century. This course is open to all students throughout NUS interested in Singapore history/studies."
  },
  {
    "courseCode": "GESS1010",
    "courseName": "Popular Culture in Singapore",
    "about": "This course is designed for both History and non-History students to explore the development and evolution of popular culture in Singapore from the colonial period to the present day. Students will learn diverse topics including Singapore's changing religious landscape, wedding and death rituals, as well as varied forms of popular entertainment from street opera, amusement parks to radio and cinema. Students should expect to gain a sensitivity to change and continuities within historical contexts, to better understand Singapore’s rich cultural heritage and to hone their skills in critical thinking, writing and presentation."
  },
  {
    "courseCode": "GESS1026",
    "courseName": "A History of Singapore in Ten Objects",
    "about": "This course facilitates an introductory inquiry into Singaporean pasts based on a cache of 'objects', broadly defined. Students will be invited to make critical observations and bring to bear their imaginations on a variety of 'objects' from Singapore’s pasts: sand, well, club, movie and sound card, among others. Students will then exercise their historical imaginations to generate interpretive possibilities pertaining to Singapore's past prompted by these objects, both individually and collectively. In reflecting on these objects and their possible connections to the past, students will emerge from this course with a broad, diverse, creative and concrete grasp of Singapore's histories."
  },
  {
    "courseCode": "GESS1037",
    "courseName": "Gender and Sexuality: A Singaporean History",
    "about": "This course is an introduction to gender and sexuality issues in Singapore from a historical perspective. We examine how our everyday understandings of gender have been formed in a long, complex process of negotiation over the twentieth century. In five themes 1) religion and marriage, 2) non-binary histories, 3) state morality, 4) queer stories and 5) gender troubles, we trace how state and religious authorities have shaped sexual behaviours and gender identities, with varying degrees of conformity and contestation from groups and individuals. Throughout history, gender remained fluid despite multiple attempts at restraining sexuality."
  },
  {
    "courseCode": "GET1023",
    "courseName": "Thinking Like An Economist",
    "about": "This course aims to explain human behaviour through the lens of economists. We use economic reasoning to answer questions as diverse as the following: Why would your teacher cheat? Which factors cause crime rates to go down? Why do countries fail sometimes? We use texts that popularize economic concepts to illustrate how different social phenomena can be understood by applying the tools of economic analysis. However, we also discuss possible limitations of the economic approach to social issues. In this course we review, challenge, and debate on firmly established ideas we all have about the world, our society, and ourselves."
  }
]