[
  {
    "courseCode": "GET1037",
    "courseName": "Big Picture History",
    "about": "This course discusses ‘big picture’ History by considering defined themes that range across time and space. The focus is not on individual societies or time periods, but on questions related to commonalities in developments across all societies. This approach is like looking at a painting from a distance instead of at the brush strokes that constitute it, and will lead to questions about what human activities and experiences constitute the global experience. As part of the Thinking and Expression pillar, this course will help students think historically and also critically engage the maxim that ‘the past is a foreign country.’"
  },
  {
    "courseCode": "GEX1002",
    "courseName": "Life, Disrupted: The Sharing Revolution",
    "about": "The Sharing Economy (a.k.a. Collaborative Consumption or Peer Economy), describes the development of new business models or platforms, through the coordinated exchanges between individuals, that disrupt traditional markets by redefining industry categories, lowering transaction costs, and maximizing the use of scarce resources. We will explore how sharing economy platforms transform the way we live: how we consume, how we work, and how we trust. Finally, we evaluate the policy responses of governments, to mitigate potential threats to our social compact as a result."
  },
  {
    "courseCode": "GEX1010",
    "courseName": "Thinking Like An Economist",
    "about": "This course aims to explain human behaviour through the lens of economists. We use economic reasoning to answer questions as diverse as the following: Why would your teacher cheat? Which factors cause crime rates to go down? Why do countries fail sometimes? We use texts that popularize economic concepts to illustrate how different social phenomena can be understood by applying the tools of economic analysis. However, we also discuss possible limitations of the economic approach to social issues. In this course we review, challenge, and debate on firmly established ideas we all have about the world, our society, and ourselves."
  },
  {
    "courseCode": "HS2923",
    "courseName": "Human-Animal Relations: History, Biodiversity & Ethics",
    "about": "Non-human animals have been essential actors in human society from its beginnings. Their existence has often been taken for granted, however, both in daily life and scholarship. This course will foreground the human/non-human animal relationship, taking methodologies from history, zoology, bioethics, and allied fields. It will be organised around such themes as the domestication, breeding, eating, worshipping, ownership, and conservation of animals, and modern conceptions like biodiversity, zoonoses, and speciesism. Students will not only be exposed to the thriving interdisciplinary scholarship on the human/animal relationship but also be invited to reflect on the role of animals in their own lives."
  },
  {
    "courseCode": "HY1101E",
    "courseName": "Engaging Asia: A Global History",
    "about": "All history is contemporary history. Nowhere is this truer than in Asia, where some of the oldest human civilisations constitute the world’s newest growth regions. In this course, we engage Asia and its varied pasts to show you how a historical frame of mind is integral to the making of a well-informed world citizen. From Beijing and Bangkok to Bangalore, from ancient dynasties to Cold War domino theories, learn about how today’s Asia continues to be at the frontier of global history. While HY1101E is a pre-requisite for majors and minors, all students are welcome to take the course."
  },
  {
    "courseCode": "HY1722",
    "courseName": "History Exchange Course",
    "about": "Not Available"
  },
  {
    "courseCode": "HY2062",
    "courseName": "Asia In The Modern World",
    "about": ""
  },
  {
    "courseCode": "HY2206",
    "courseName": "China's Imperial Past: History & Culture",
    "about": "This course provides a broad survey of Chinese imperial history from the classical period to the eighteenth century. Apart from placing this general history within a chronological framework, it will be analysing major political events and long-term trends in the development of Chinese statecraft, economic and social institutions, philosophy and religion, literature and art, as well as relations with the outside world. The course is mounted for undergraduates throughout the university with an interest in China, especially its history, politics and culture."
  },
  {
    "courseCode": "HY2207",
    "courseName": "The Struggle for Modern China since 1800",
    "about": "At end of the 18th century, the vast and diverse territories of China were ruled by an Inner Asian peoples known as Manchus and an empire known as the Great Qing. Today, the People’s Republic of China, the second of two states to succeed the Qing, is an economic superpower. How did we get from then to now? In this course, we will delve into the recent, tumultuous history of China in the wider world with the aim of understanding how imperialism, rebellion, war, and revolution have transformed its society, politics, culture, and economy over the past two centuries."
  },
  {
    "courseCode": "HY2208",
    "courseName": "Pre-Modern Japan: History and Culture",
    "about": "This course explores major developments in the premodern Japanese polity, economy, culture and society, from the early ages to the end of the eighteenth century. Its main themes include studies in Japanese origins and mythology, court culture and popular culture, samurai and shogunal rule, economic and social trends, intellectual and religious developments, and Japan's interaction with the outside world, notably, China, Korea, Southeast Asia and the West. The relevance of Japan's premodern heritage to present?day Japan will also be emphasized."
  }
]