[
  {
    "courseCode": "HY2210",
    "courseName": "State & Society in Early-Modern Europe",
    "about": "This course deals with cultural, economic, political, intellectual and religious movements in continental Europe from an urban perspective. The objective is to enable students to appreciate essential patterns and ideas which have shaped the European cultural and historical inheritance that remain relevant today. This course is open to all students who take an interest in history, culture and questions pertaining to societal development."
  },
  {
    "courseCode": "HY2216",
    "courseName": "Total War, 1815-1945",
    "about": "After 1815, the Industrial Revolution and mass politics changed warfare. The new pattern of Modern War that emerged led to a further and more dramatic change: war between great industrial powers for unlimited ends, using unlimited means. Why did this happen and how did it affect the course of history? This course will pursue this question, analyzing changes in the nature and pattern of warfare to identify and explore the characteristics of Total War. It will concentrate on the Second World War. This course is designed for students throughout NUS with an interest in history."
  },
  {
    "courseCode": "HY2217",
    "courseName": "Warfare after 1945",
    "about": "No general war has been fought since 1945, but there has not been one year free of war since then either. That is the theme of this course: why has post 1945 warfare been limited yet chronic? By studying selected wars in their international, political and social context, this course will address that question. This course is designed for students throughout NUS with an interest in history."
  },
  {
    "courseCode": "HY2220",
    "courseName": "Korea in the Twentieth Century",
    "about": "This course deals with the history and impact of Japanese rule in the Korean peninsula, of independence in 1945 followed by the 'Korean War' and partition, and of the economic, political and social transformations in South Korea and North Korea from the 1960's to 2000's. The approach adopted is a thematic one, and certain topics will be selected for analysis."
  },
  {
    "courseCode": "HY2225",
    "courseName": "East-West Artistic Interactions",
    "about": "This course explores Europe and Asia's mutual fascination with, and appropriation of, each other's visual and material cultures. From the Buddhist art of Central Asia to KL Petronas Towers through medieval textiles, chinoiseries, Orientalist paintings, colonial architecture, museums, modernist avant-gardes and postmodernism, the course surveys chronologically some fifteen centuries of East/West artistic interactions while introducing students to the disciplines (art and cultural history, post-colonial and cultural studies) concerned with visual culture. The course is open to students from all faculties and does not require background knowledge of art history."
  },
  {
    "courseCode": "HY2231",
    "courseName": "Upheaval in Europe: 1848-1918",
    "about": "This course - which is offered to all students with an interest in Modern European History - will explore the significant features and impact of nationalism, imperialism and adventurism as they relate to Europe in the dramatic seventy-year period from the upheavals of the 1848 revolutions to the end of the First World War. During this period Europe became the center of a new and deadly game of power politics in which any semblance of defeat was reason enough to prepare the ground for revenge. Eventually, war took its toll on every major participant from 1914-18."
  },
  {
    "courseCode": "HY2232",
    "courseName": "The Modern History of Japan: From Edo to the Present",
    "about": "This course surveys the history of modern Japan from the late‐Tokugawa period to the present. Its primary goal is to promote basic understanding of major events, while also aiming to analyze the modern history of Japan in transnational and comparative contexts through exploring a number of common themes of modern global history: nation building, colonialism, total war, and various transformations and social conflicts in the postwar period. Through such examination, the course aims at promoting critical thinking concerning diverse historical interpretations and controversies. Accordingly, students will be exposed to a broad range of historical debates and viewpoints throughout the course."
  },
  {
    "courseCode": "HY2233",
    "courseName": "International History of Singapore",
    "about": "This course will be a broad survey of political, diplomatic, economic, social and cultural forces that have globalised Singapore since independence in 1965. The exploration of such themes in the assigned readings by journalists, and scholars in history, sociology and international studies will expose students to a wide range of approaches and discourses. This introduction to Singapore will provide students opportunities to investigate and understand some of the common challenges faced by all newly independent nations of Southeast Asia in devising and implementing policies to cope with international and regional developments."
  },
  {
    "courseCode": "HY2235",
    "courseName": "Environmental History",
    "about": "This course is designed to introduce students to major themes in Environmental History, meaning the historical study of the mutual influence of humans and the environment. After critically evaluating how the discipline of Environmental History has developed, lectures and discussions will focus on topics such as disease, agriculture, gender and modern environmental problems. Lectures will be combined with research assignments that will help students better understand how a historian approaches a topic. Students interested in history, the environment or new approaches to the past will be interested in the course."
  },
  {
    "courseCode": "HY2236",
    "courseName": "US Media in the 20th Century & Beyond",
    "about": "This course examines the part of the U.S. media in shaping American society and culture beginning with the New York Journal's advocacy of the Spanish-American War of 1898 through to the role played by CNN in the 1990s. The course will review the growth of mass circulated newspapers, magazines, radio and television and examine how new media forms, such as the Internet, shape and are shaped by society. Students will learn to critically evaluate media forms and media content in a historical context. This course is well suited for students interested in the USA or media."
  }
]