[
  {
    "courseCode": "HY2237",
    "courseName": "The U.S.: From Settlement to Superpower",
    "about": "This course seeks to provide students with a basic grounding of American historical and cultural developments from European colonisation to the end of the twentieth century. It will examine both the internal developments in the United States as well as its growing importance in international politics. By offering a range of social, economic, and political perspectives on the American experience, it will equip students with the knowledge for understanding and analysing the dominance of the United States in contemporary world history and culture. This course is designed for students throughout NUS with an interest in American history."
  },
  {
    "courseCode": "HY2242",
    "courseName": "Singapore's Military History",
    "about": "Singapore is a sovereign nation‐state with formidable armed forces but its military situation is still very much governed by its place in the Malay world and its fluctuating strategic value to great powers. This course showcases the value of a 700‐year approach to the island’s military history and examines the relative impact of its distant and recent past on its present situation. This course has no pre‐requisites and is suitable for any student with an interest in Singapore’s history or military history in general."
  },
  {
    "courseCode": "HY2245",
    "courseName": "Empires, Colonies and Imperialism",
    "about": "Students will gain a basic understanding of empires in history. Individual empires will be studied to demonstrate patterns regarding the origins, development and collapse of empires. Topics will include the expansion of empires, colonization, military conquest, administration, and ideologies of empire. The humane side of imperialism will also be explored: the course will get students to try to understand the experience of subject peoples while also regarding empires as sites of cultural interaction. Finally, students will be introduced to some of the interpretative paradigms which have shaped the scholarly exploration of empires."
  },
  {
    "courseCode": "HY2247",
    "courseName": "Sport and History",
    "about": "The course explores the connections between sport and history. It will investigate the ways in which history has produced sport. Emphasis will also be placed upon the ways in which sport has shaped history. This course provides an opportunity to compare societies and cultures as they are reflected in sport and competition. Topics can include pre-industrial forms of sport (in Meso-America, Classical Greece and Medieval Europe, Southeast Asia, and Japan), the impact of industrialization, the emergence of modern team sports, the Olympic movement, Colonialism and Sport, Olympic politics, sport and the American civil rights movement, and sports and globalization."
  },
  {
    "courseCode": "HY2249",
    "courseName": "Art and History",
    "about": "This course explores the common ground between the discipline of history and art history by considering images as historical evidence It concerns itself with both Western and Asian art in the time period from the 5th c. BC to the 20th c. The learning objectives are twofold: acquire the conceptual tools to understand the meaning of images and read visual narratives as historical texts."
  },
  {
    "courseCode": "HY2250",
    "courseName": "Introduction to Southeast Asian History",
    "about": "This course introduces Southeast Asia’s past from earliest times to the present (1st century to 21st century). It highlights how processes of interaction, circulation, and connection shaped the key characteristics and worldviews that are associated with the region today. Course content will focus on how local communities adopted and adapted influences from around the world to form a distinctive regional culture. How polities emerged via the region’s historical interaction with Indian, Chinese, Islamic, Iberian, European, Japanese, and New World civilizations will be given special attention. Today’s nation-states and regional organizations are a product of this long history of community formation."
  },
  {
    "courseCode": "HY2251",
    "courseName": "From the Wheel to the Web",
    "about": "This course explores the role of technology in human history from Ancient times until today. Does technology drive history, or is it the other way around? Examining a variety of important technologies - ships, windmills, telephones, and of course wheels and the internet - the course will follow a different path through time than that commonly taken. We?ll not forget politics or society, however, because 'technology' turns out to be as much about people as hardware. Wars, geopolitics, and the discovery of new pleasures and anxieties are all interwoven with the history of tools and techniques. The course is open to students from any faculty."
  },
  {
    "courseCode": "HY2252",
    "courseName": "Introduction to Business History",
    "about": "This course introduces key themes relating to global business history. It considers how business and enterprise have contributed to the making of the modern world. It looks at key economic actors, agents and institutions of historical change, their forms of organization, their strategies and culture, their relations with state and society and at how economic practices have been shaped by culture. Some of the themes covered will be: the business firm; the nineteenth century revolution in production, distribution, transport and communication; the rise of retailing; integration of mass production and distribution; managerial capitalism; multinationals; state -business relationships; and, culture and capitalism."
  },
  {
    "courseCode": "HY2253",
    "courseName": "Christianity in World History",
    "about": "This course will look at the evolution of Christianity and its impact on Western and global history. It will trace the development of the various branches of Christianity (Catholic, Orthodox, Protestant) and how the conflicts among them shaped European history. It will consider the role of religion in American history. It will look at the linkages between missionary efforts and imperialism, as well as the consequences of conversion in colonial societies around the world. It will also look at how Christianity has been linked to ethnicity and nationalism in the post-colonial nation-states."
  },
  {
    "courseCode": "HY2255",
    "courseName": "Islam in World History",
    "about": "The purpose of this course is to provide a historical introduction to Islam’s core beliefs, practices, and institutions as they have developed in diverse cultural and political contexts. The course will consider a range of topics all approached historically, among them: Islam’s foundational texts, religious expressions, institutions and cultural forms, as well as the challenges posed by changing economic and social conditions for Muslim societies in the modern period. The objective is to provide an informed appreciation of the historical development, cultural diversity, and contemporary issues facing Muslim communities across the world."
  }
]