[
  {
    "courseCode": "HY2257",
    "courseName": "Law, Crime, and Punishment in History",
    "about": "Law, Crime, and Punishment are all social concepts subject to historical change. In the case of law, historical precedents are important in determining how best to apply the rule of law. By presenting a set of themes in the history of law, crime, and punishment across time and cultures, this course allows students to examine processes of change in how these concepts are understood, applied and structured. History as a practice is an investigative process and both historians and criminal investigators seek to determine what happened, and why and how it happened. The course is organised thematically dealing with concepts of crime and law, particular crimes and laws, ways of understanding crime and law, and popular understanding of crime and law. On the whole the course has a western focus but there are global comparisons."
  },
  {
    "courseCode": "HY2258",
    "courseName": "Passage to India: Modern Indian Society",
    "about": "This course will introduce students to contemporary India through a study of society and culture. Taking a thematic approach, it will examine caste and class, religion and identity, language and region and popular forms of culture. It will assess the social and cultural change that India has undergone since 1947 and the remarkable continuity of its social institutions. Factors and processes that have held India together despite its diversity and cultural heterogeneity will be highlighted. This course is open to all students, interested in understanding the nature of socio‐cultural change in one of the world’s oldest civilizations and largest democracies."
  },
  {
    "courseCode": "HY2259",
    "courseName": "The Craft of History",
    "about": "This course introduces students to some of the important methodologies, approaches, and themes in historical research through weekly seminar-style sessions in which students analyze academic work and develop their own research plans. In other words, this course aims to provide students with the fundamental skills needed for academic historical research, such as how to interpret scholarly work, how historians have approached the past, and how to develop a research question and place it within broader historiographical currents."
  },
  {
    "courseCode": "HY2260",
    "courseName": "History and Popular Culture",
    "about": "This course examines the ways popular culture shapes understandings of history on two different levels. First, it examines how the popular culture of a specific era can reveal much of the social milieu of the time and help contextualise events of that period. Second, it will examine how popular culture, such as a film, created at a later time can influence perceptions about an earlier era. This course will examine instances and eras of popular culture to discuss the challenges of deriving historical knowledge from popular culture. Each iteration of the course may vary in its focus."
  },
  {
    "courseCode": "HY2261",
    "courseName": "Modern Middle East History: From 1699 to the Present",
    "about": "This course provides a brief introduction to the modern Middle East from 1699 to the present. It covers events and trends that shaped and ended the Ottoman Empire, the rise of European imperialism, processes of social change and state-building, creation of “new orders,” (constitutional republics, Islamic regimes or authoritarian states), the Cold War, and relations between state and society during times of local, regional, and global change. To that end, we will read a wide array of writings, including standard textbooks, academic articles, official documents, memoires, and novels."
  },
  {
    "courseCode": "HY2262",
    "courseName": "The Ancient World: The Roman Empire",
    "about": "This course asks: why should we care about Roman history? What key questions do real-life historians use to investigate Roman society – its emperors, gods, wars and civil wars, households, women, slaves, philosophy, literature and technology? How can I interpret evidence to assess and make persuasive historical arguments about ancient Rome? And how are these themes and issues relevant today? Trace how the ideas and impact of the Roman empire are visible in our own politics, social discourses, art, media and pop culture, including the historical background to a major world religion – Christianity."
  },
  {
    "courseCode": "HY2263",
    "courseName": "The Ancient World: Ancient Greece",
    "about": "Ancient Greece, from Homer to Alexander the Great, leaves us an enduring legacy. Its myths, art, and ideas remain in our politics, modes of thought, and visual culture. Trace the historical, scientific and cultural roots of the modern West, and discover the origins of democracy at Athens; Sparta and the Persian wars; women and family; and slaves, ‘barbarians’ and the construction of the Other in Western thought. Explore Greek elements in today’s pop culture - heroes, legends, gods and goddesses. We also learn how to read and interpret ancient art and literature, and to construct persuasive historical arguments using evidence."
  },
  {
    "courseCode": "HY2264",
    "courseName": "The Making of Modern Europe",
    "about": "This course offers an overview of the major events, actors, and developments that have shaped the course and character of Europe since the French Revolution. From the rise of nationalism, industrialization, and imperialism that paved the way for World War I, this course sketches out the making and remaking of Europe during the nineteenth and early twentieth centuries. This course is designed for all students interested in acquiring an understanding of modern Europe."
  },
  {
    "courseCode": "HY2265",
    "courseName": "Buddhism in World History",
    "about": "Buddhism is one of the major religions of the world. This course explores the birth and evolution of Buddhism and its impact on Asian and world history. It will consider sources drawn from various Buddhist traditions (Theravada, Mahayana, Vajrayana), from ancient times to the present day. Through an examination of the spread and development of Buddhism in Asia and the West, the course will address a range of topics, such as the relationship between Buddhist institutions and the state; local traditions and popular practices; travel and trading networks; imperialism and nationalism; and globalization and modernism."
  },
  {
    "courseCode": "HY2266",
    "courseName": "Heroes of China",
    "about": "Across time and space people have been fascinated with legends of heroes, particularly those that enshrine the essential values of human culture of a given society. This course, adopting a comparative approach, introduces salient features of Chinese culture—norms like filial piety, loyalty, patriotism, and great unity—through a dozen selected hero and hero-making stories across time within China. In examining these stories, this course also analyzes key themes of identity, sexuality, and ethnicity that have configured distinctive characteristics of Chinese heroes."
  }
]