[
  {
    "courseCode": "HY2267",
    "courseName": "Love: Histories of an Emotion",
    "about": "Is love universal? How have concepts and expressions of love changed over time? What does a history of love tell us about politics, social norms, cultural artefacts, religious practices and gender relations in any society? Using historiographical tools from the history of the emotions, we will examine different kinds of love in diverse regions across the centuries: family, platonic, courtly, divine, romantic and erotic love; lovesickness, unrequited and forbidden love. Drawing from ars erotica, courtly romances, talismans, spells, romantic poetry and love letters, this course is intended to encourage students to think widely about cultural specificities and universal emotions."
  },
  {
    "courseCode": "HY2268",
    "courseName": "Introduction to Public History",
    "about": "This course introduces students to public history theory and practice. A fundamental premise of the course is that practicing public history well requires an outlook, ethical stance, and set of skills that go beyond what is usually required of historians. This course will focus on five key concept areas that inform the world of public history: History and Memory; Shared Authority and/or Inquiry; Agendas and Audiences; Media Technology; Interpretation and Preservation."
  },
  {
    "courseCode": "HY2269",
    "courseName": "Histories of the Body",
    "about": "This course seeks to examine the human body as a historical phenomenon. Students will be introduced to the diverse ways in which the body, its parts and its attributes, have been conceived, experienced and treated in different cultures and societies across different time periods. Placing the body at the intersection of religion, politics, empire, science, medicine, gender, race and sexuality, students will explore the ever-shifting meanings of the body and its multiple histories."
  },
  {
    "courseCode": "HY3201",
    "courseName": "Indonesia: History, Economy and Society",
    "about": "The upheavals that took place in Indonesia during the 1940s, the 1960s and the 1990s have deep historical roots, and are linked to social and religious divisions within the country. The course examines the historical background to changes that have taken place in Indonesia over the past 50 years, considering topics such as Islam and politics, the role of the army, and separatist activity in the Outer Islands. This course is designed for students throughout NUS with an interest in history."
  },
  {
    "courseCode": "HY3202",
    "courseName": "International History of SE Asia",
    "about": "Situated between India and China, Southeast Asia in historical times became an important economic and geostrategic nexus in the context of the international trade that stretched from Europe to China and the big power rivalry that accompanied it. As its significance grew, internal conditions within Southeast Asia adjusted to accommodate increased external contacts while the rival powers, including those from the periphery and from without the region, increasingly saw Southeast Asia as an element in the global power game. This course will examine the structure of Southeast Asia's history within this global context, relating the nature and sequence of its history to developments in the wider international milieu."
  },
  {
    "courseCode": "HY3204",
    "courseName": "Southeast Asia: Decolonization & After",
    "about": "That the Second World War impacted Southeast Asia is beyond doubt. But the significance of its impact on the structure of the region's 'contemporary' history is more debatable, for revisionist historians are wont to discount the thesis that the War represented a significant turning point or watershed which 'transformed' the region's history. Drawing on both country and regional perspectives, this course first assesses the impact of the War on the theme of decolonization, perhaps the one major historically significant process to dominate the region's political terrain in the immediate post-war aftermath. It will further examine the challenges and trials confronting the new states \"after\" decolonization, in particular, their search not only for new political frameworks to replace the colonial structures they had discarded, but also for solutions to mitigate the issues of social integration, inter-state conflict and regional co-operation."
  },
  {
    "courseCode": "HY3205",
    "courseName": "Society & Economy in Late Imperial China",
    "about": "This course explores the social and economic changes in late imperial China from the Tang-Song transition to the end of Qing. The central themes include the periodization of the imperial period in Chinese history, agricultural and urban development, and population growth. This course highlights their relevance to world history. Key questions include why and how China’s modern transition differed from what we have conventionally understood as a general modernization pattern, the crucial role played by energy resources and the environment in this transition, and what lingering effects such a pattern left on the present-day economic development in China."
  },
  {
    "courseCode": "HY3206",
    "courseName": "East Asian International Relations",
    "about": "The course examines the development of international relations in East Asia from the Opium War to the Korean War. It now only discusses major international events, such as conflicts, treaties, and alliances, but also examines the interplay between domestic and foreign affairs, the spread of political ideologies, and the rise of nationalism and racial/eithnic identities."
  },
  {
    "courseCode": "HY3209",
    "courseName": "Cold War in Europe, 1945-1991",
    "about": "This course will trace the historical development of the major Western and Central European Powers from the late 1930s up to the fall of the Berlin Wall in November 1989 and the reunification of Germany in October 1990. Apart from the international challenges posed by the Second World War and the subsequent Cold War, the European states were also beset by numerous acute domestic crises that required remedial treatment by their governments. Some received it and prospered, others did not and languished."
  },
  {
    "courseCode": "HY3214",
    "courseName": "History of Strategic Thought",
    "about": "From Sun Tzu through theorists of nuclear warfare, military strategists have tried to define the theory and principles of war. For good or bad, that work has affected the conduct of war. Using the writings of selected strategic thinkers, this course studies the evolution of strategic thought and its impact on the practice of war."
  }
]