[
  {
    "courseCode": "HY3217",
    "courseName": "The Making of Colonial Indochina",
    "about": "This course will focus on the colonial period in Vietnam, Cambodia, and Laos. In addition to the political, social, and economic effects of colonial rule in each of these countries, attention will be given to the evolution of 'Indochina' as an entity created by the French and to its impact on relations among the Vietnamese, Cambodian, and Lao peoples. These issues will be examined in the context of precolonial history and as a backdrop to the destructive warfare, that followed independence."
  },
  {
    "courseCode": "HY3223",
    "courseName": "Technology and Culture in the Asia-Pacific",
    "about": "This course will introduce Asian, European, and American material from the late nineteenth century to nearly the present day, concentrating on social and cultural themes such as industrialization, colonialism, science and race, technology and war, computers and global telecommunications and biotechnology and the human genome project. It will be taught as a series of cases illustrating important events and multiple themes. The proposition that modern science and technology have been 'socially constructed', reflecting political and cultural values as well as the state of nature, will be examined rather closely. Some theoretical material will leaven our otherwise empirical focus."
  },
  {
    "courseCode": "HY3224",
    "courseName": "China and the Maritime World",
    "about": "This seminar explores China's place within the larger maritime world, beginning with the voyages of Ming dynasty eunuch Zheng He and culminating in the South China Sea dispute in our time. We will focus partly on states and societies that claimed China’s coastal regions and the oceanic spaces surrounding it, and partly on the networks, institutions, and economies linking China to a wider maritime sphere. Readings will be drawn from both primary sources and scholarship on topics such as the Zheng organization on Taiwan, steamships, overseas migration, fishing, smuggling, and reform and opening in the late 20th century."
  },
  {
    "courseCode": "HY3225",
    "courseName": "Minorities in Southeast Asia",
    "about": "With the creation of colonial states in Southeast Asia, certain peoples in the region became minorities owing to their languages, religious beliefs or customary practices. Examples include the Shan and Karen in Myanmar, Muslim minorities in Myanmar, Thailand and the Philippines, the people of the Mountain Province in the Philippines, Christian communities in Indonesia, the hill peoples of Thailand, Malaysia and Indonesia, and animist groups in Borneo and the Eastern archipelago. Colonial administrations often made special provisions for these minorities, but with independence the dominant ideology across the region called for a single national identity within each nation-state. This course examines the position of minorities under colonial and post-colonial governments. It surveys the minorities of the region, and develops case studies dealing with selected groups. This course is designed for students throughout NUS with an interest in history."
  },
  {
    "courseCode": "HY3226",
    "courseName": "Memory, Heritage & History",
    "about": "This course invites the student to reflect critically on the ways the past is established, experienced and represented in the present. The objective is to foster an appreciation of history as a dynamic undertaking in which not only academics but societies as a whole participate. The course is comprised of a theoretical core and changing case studies that touch on media representations, museology and conservation, historiography and the philosophy of history. CA projects afford students the opportunity to experience first-hand how history, far from being confined to libraries and archives, is part of daily life. While the course targets primarily History majors, its cultivation of critical skills in the analysis of written and visual texts is relevant to students from all faculties."
  },
  {
    "courseCode": "HY3227",
    "courseName": "Europe of the Dictators",
    "about": "Europe was plagued by wars, revolution and totalitarian dictatorship between 1919 and 1945. It witnessed the rise of Bolshevism and of various Fascist regimes, revealed the economic and political weakness of the Western democracies and the failure of the League of Nations. This course will focus on the rise of four dictators of this period: Mussolini, Franco, and Hitler. All students are welcome, but those coming with a background in Political Science and even Sociology may find this course builds on existing knowledge and concepts."
  },
  {
    "courseCode": "HY3228",
    "courseName": "The Evolution of Vietnam as a Nation",
    "about": "This course studies the growth and expansion of Vietnam over the centuries to look at how this history has affected its culture and development. Particular attention is given to how the Vietnamese tell the story of their own past and how they perceive their history as a nation. The course is intended for students with a particular interest in Vietnam and for others who would like to do an in-depth study of a single country; it raises issues about nationhood and historical narrative which are applicable to many other cases."
  },
  {
    "courseCode": "HY3230",
    "courseName": "American Business: Industrial Revolution-Web",
    "about": "This course examines the place of business and technology in American culture. Beginning with the transformation of the American economy during the Civil War (1861-1865) students will examine changes in manufacturing systems, the development of corporations and big businesses, the growth of the national and international markets, the invention and marketing of new products, brand names, and advertising. The course asks students to evaluate the place of business in shaping American values and culture and whether companies such as Coca-Cola and Microsoft are typical or untypical of U.S. values. For students interested in the USA, business, and society."
  },
  {
    "courseCode": "HY3231",
    "courseName": "History of the Malay World",
    "about": "This course focuses on the histories of the Malays who have populated the Straits of Melaka and the South China Sea. Discussions and lectures do not focus on chronology or a simple narration of \"facts,\" but upon a critical examination of questions such as \"who is Malay?\" and \"what is the Malay World?\", allowing for a better understanding of the key social, cultural, political, and economic practices and institutions that have shaped the Malay experience. The course will be of interest to any student who wants to know more about Malays and the societies in and around Singapore."
  },
  {
    "courseCode": "HY3237",
    "courseName": "Issues in Thai History",
    "about": "This course provides a thorough survey of the history of Thailand. Material covered in the course is divided between developments in earlier centuries and those of the modern period, with a balance between political and cultural history. Particular attention is given to the different ways in which Thai history can be narrated. The course is intended for students with a particular interest in Thailand and for others who would like to do an in-depth study of a single country."
  }
]