[
  {
    "courseCode": "HY3238",
    "courseName": "The U.S. Presidency",
    "about": "This course examines major topics in U.S. political history through the lens of the presidency. How has the office evolved? How has the U.S. government's role in American society and worldwide changed? What can the presidency teach us about US history and society? Engaging in this course will help students grasp scholarly questions about U.S. political history, place the presidency in broader historical settings, and identify significant turning points. This course is designed for all NUS students interested in U.S. political history. Although there are no prerequisites, it will be helpful to have some prior knowledge of U.S. history."
  },
  {
    "courseCode": "HY3239",
    "courseName": "The United States in the Asia-Pacific",
    "about": "This course will focus on the role of the US in the Asia-Pacific region from the nineteenth to the twenty-first century. The evolution of political, military and economic ties between the America and three sub-regions of Asia will be explored. The nature of US involvement in the conflicts of the East Asian nations of Japan, China and Korea will form the first part of the course. The involvement of America in the decolonization and nation-building of the Southeast Asian nations will also be examined. Finally, the American influence in the sectarian and power differences in the South Asian nations of India and Pakistan will be addressed. This course is designed"
  },
  {
    "courseCode": "HY3240",
    "courseName": "Making America Modern",
    "about": "In 1901 only 14% of American homes had a bath and 8% a telephone. The country however was undergoing a process of economic, social, and cultural modernity that laid the basis for it emerging as the pre-eminent power in the world by 1945. This course examines the transformation of America from 1880. Students will study the processes of modernity in America both as economic modernisation and cultural modernism. The course asks students to evaluate the relationship between various aspects of American modernity. The course is for students interested in the culture and society of the USA."
  },
  {
    "courseCode": "HY3242",
    "courseName": "Modern Imperialism",
    "about": "The course relates the study of modern European imperialism to some topics outside of Europe. It examines a dimension of modern imperialism. Themes will include the economic basis of imperialism, the interaction of cultures (within imperial networks), the migrations of peoples, missionary movements, the management of religion and motives and means of imperial control. Normally one geographical area of imperial experience will be explored in depth."
  },
  {
    "courseCode": "HY3243",
    "courseName": "China and Southeast Asia: Past & Present",
    "about": "This course examines the history of relations between China and Southeast Asia, with an emphasis on the modern period. We will explore in weekly seminars the various dimensions and dynamics of China-Southeast Asian relations, including the evolution of regional state structures, tributary relations, maritime trade, migration, the impact of Western colonialism, nationalism and communism, the Cold War, and the rise of China in recent times. Though a basic knowledge of Chinese and Southeast Asian history will be helpful, the course is open to all undergraduate students who are interested in the topic."
  },
  {
    "courseCode": "HY3245",
    "courseName": "Engendering History/Historicising Gender",
    "about": "Gender history emerged as a scholarly discipline in the late 20th century as a way to challenge established historical narratives that overlooked the roles and experiences of women. The field has evolved considerably over time, moving away from the recovery of women in history towards a reconceptualization of gender as intimately related to power. This course adopts a historical perspective on the ways in which gender has served as a tool for articulating and naturalising differences and examines how gender intersects with other social categories such as race, class, and sexuality, to understand power dynamics and social inequalities. Students will read seminal texts from the ever growing field of gender history and explore the differing ways in which scholars have approached history through the lens of gender."
  },
  {
    "courseCode": "HY3246",
    "courseName": "History of Muslim Southeast Asia",
    "about": "This course will examine the history of Muslim states and cultures across Southeast Asia. The goal of this course is to provide students with contextualized understandings of more recent developments, as well as to facilitate comparative reflections on the trajectories of other cultural and political traditions in the region. Major topics to be covered include the spread of Islam, the development of vernacular Muslim cultures, the rise of regional sultanates,the impact of colonialism, and issues related to the expression and manipulation of religion in the modern nation-states of Southeast Asia."
  },
  {
    "courseCode": "HY3247",
    "courseName": "From Monarchy to Military: History of Myanmar",
    "about": "This course explores the history of Myanmar (Burma). Organized chronologically from the emergence of the earliest polities to the present, students will examine the formation and interaction of communities, ideological worldviews, ethnic identities, and material cultures that have characterized the societies that evolved along the Irrawaddy River basin and beyond. Course content will consider the particulars of Myanmars history (early stateformation and the historical development of Burmese identity) within regional/global processes and themes. Fundamentally, this course addresses why contemporary Myanmar is perceived to be so different from its regional neighbours despite sharing many historical and cultural experiences."
  },
  {
    "courseCode": "HY3248",
    "courseName": "People's Republic of China, 1949-1989",
    "about": "This is an upper-level seminar on the history and historiography of the most consequential imperial nation-state in the world today, from its founding at the supposed end of the Chinese Civil War in 1949 to the Tiananmen Square protests and massacre in 1989. After a brief, synoptic overview of modern Chinese history until 1989 in the first two weeks, we will spend the rest of the semester working our way chronologically and thematically through major periods and issues in PRC history."
  },
  {
    "courseCode": "HY3250",
    "courseName": "Approaches to Singapore History",
    "about": "This course is aimed at students who wish to deepen their understanding of Singapore history through an examination of different representations of history: (a) academic scholarship, (b) social memory and oral history, (c) heritage. Each section will incorporate fundamental concepts and debates behind the production of history, together with the application of these ideas to specific Singapore case studies. At the end of the course, students will be able to critically analyse Singapore history as a whole in terms of historiography and heritage studies, whilst gaining familiarity with the treatment of key issues in Singapore’s past."
  }
]