[
  {
    "courseCode": "HY3251",
    "courseName": "India’s Pursuit of Prosperity",
    "about": "This course studies the historical roots of India’s economic backwardness, stagnation and development as well as its recent emergence as a global economic player. Divided into three segments, it examines the Indian economy: a) during colonial rule, b) under the ‘developmental state’, and finally c) in the post liberalization period. The topics covered include: India’s role in 19th century world economy, growth of urban centers, rise of industrial capitalism, emergence of working class, nature of post‐independence development planning and the rising ‘consuming classes’. The complex relations between politics and economy and linkages between socio‐cultural factors and economic developments are discussed."
  },
  {
    "courseCode": "HY3252",
    "courseName": "From Tropical Medicine to Bioscience",
    "about": "This course examines “tropical” medicine in the three related contexts of colonialism, high imperialism, and nation‐building. The course will survey medicine, disease, and epidemics in British, American and Japanese practice, spanning the 18th to 20th centuries, and culminating with present‐day Asia and the place of biomedicine in contemporary nation‐states, including Singapore. The course covers the transformation of a scientific field from a colonial body of knowledge to a form of practice embraced and utilized by post‐colonial societies."
  },
  {
    "courseCode": "HY3253",
    "courseName": "Nation and Empire in East Asia",
    "about": "When did multi‐ethnic China become a nation? Why did island Japan become an empire? From 1800 to the present day, the two main East Asian powers have shifted back and forth between the ideas and institutions of empires and nation‐states. These changes shaped policies towards ethnic, linguistic and religious minorities, and diplomatic relations with neighbouring states. This course also integrates current debates on statecraft and imperialism to show the ideas behind important historical turning points remain relevant today. Background in Asian history or International Relations is strongly recommended."
  },
  {
    "courseCode": "HY3254",
    "courseName": "Cold War in East Asia",
    "about": "No one can say that the Cold War has ended yet in East Asia. But rather a number of the contemporary intra‐regional tensions in East Asia stem from the Cold War era; from the tensions over the Taiwan Straits, to the temporary cease‐fire status between North and South Korea, to the constitutional controversy in Japan. With a special emphasis on the international dimension, this course explores how the Cold War confrontation (1945‐present) has unfolded in the historical context of East Asia over the past decades."
  },
  {
    "courseCode": "HY3256",
    "courseName": "Brides of the Sea: Asia's Port Cities",
    "about": "Brides of the Sea', 'Gateways to Asia' and 'the transformers of Asia' are some of the ways scholars have described Asian port cities. Through case studies, this course explores the port city and the 'maritime world' in Asia. Students are introduced to the history of China's maritime world with a focus on the challenges it faced through encroachment by Western imperial powers. This course also examines Asia's colonial port cities, including Calcutta and Singapore, as sites of Western influence and modernization and also as sites of local resistance and transformation. This course is suitable for all students of NUS."
  },
  {
    "courseCode": "HY3257",
    "courseName": "The Philippines: A Social and Cultural History",
    "about": "This course will explore the Philippines’ almost 500 years of social and cultural history—from its early association with India, China and Southeast Asia, to its incorporation into the Spanish and American empires, to its tumultuous road towards independence and democratization. Students will consider Filipino religiosity and worldview, and analyze their ramifications in society. Popular images of the Philippines – homeland of international labor and site of natural hazards and spectacle of poverty – will be investigated. Students will take Philippine history as an exemplar towards a better understanding of the postcolonial condition that numerous nations experience."
  },
  {
    "courseCode": "HY3258",
    "courseName": "Cold War in the Global South",
    "about": "This course is about the history of the Cold War in the global south in the second half of the twentieth century. While the Soviet-U.S. rivalry and the European Cold War did not escalate into large-scale conflict, developments elsewhere were marked by significant violence and destruction. This course seeks to reconcile, if that is possible, the perception of the history of the Cold War as a “long peace” with the turbulent lived experiences of peoples in the global south. Which, and whose, Cold War best defines the history of the twentieth century?"
  },
  {
    "courseCode": "HY3259",
    "courseName": "Issues in Korean Cultural History since 1945",
    "about": "Having achieved modernization and economic development in a remarkably short span of time, Korea demonstrates many unique features within sociocultural processes and issues that are common to newly industrialized countries (NICs). This course deals with issues in the cultural and social history of Korea in the second half of the 20th century. Topics covered may include the development of popular and consumer culture, national identity, family and gender, education and employment, and religious and political life of Koreans in the period since 1945."
  },
  {
    "courseCode": "HY3260",
    "courseName": "Chinese Migrations in World History",
    "about": "This course surveys the major patterns and themes of Chinese migrations since 1400. From merchants under the tributary trade system, to indentured and free labour in the industrialising age, as well as the making of new citizens in multi-culturalist nation-states, students will examine the social experience of long-distance migration through regional and global processes of political-economic change. In addition to academic texts, students will read official documents, family letters, memoirs, and novels to address enduring questions in the history of human migration – why do people leave their homes, and what remains when they adapt to their lands of adoption?"
  },
  {
    "courseCode": "HY3261",
    "courseName": "Historicizing Science, Technology and Society",
    "about": "This course surveys the history and philosophy underpinning science, technology and society. In part 1 we will examine the history of the Scientific Revolution and its historiographical significance. With this context in mind, part 2 shifts focus to the impact of science and technology on modern societies, keeping in mind the broader historical circumstances that have shaped these forces. Students will encounter historical and contemporary case studies from regions including Europe, the United States and Asia. Themes and topics will allow for an enhanced understanding of the intersections that science and technology have with race, gender, imperialism and the environment."
  }
]