[
  {
    "courseCode": "HY3262",
    "courseName": "Buddhism In Southeast Asian History",
    "about": "From its origins in India, Buddhism has expanded across the world and taken deep root in diverse societies across Asia over the past two thousand years. This course traces the development of both Theravāda and Mahāyāna Buddhism in Southeast Asia. Major topics to be covered include the spread of Buddhism, the rise of Buddhist kingdoms, the development of popular traditions, the impact of European colonialism, the relationship between Buddhism and nationalism, the emergence of modern reformist movements, and Buddhist minorities in maritime Southeast Asia."
  },
  {
    "courseCode": "HY3263",
    "courseName": "Imperialism and Anti-Colonialism in South Asia",
    "about": "This course will study political ideologies that served to legitimize colonial control in South Asia as well as the struggles against them. Through a series of case studies that focus on a range of issues, students will gain a better understanding of how imperialist discourses categorized and hierarchized communities on the basis of conceptions of religion, masculinity, supposed propensity to violence and hyper-sexuality. Students will also engage with revolutionary ideologies developed by anti-colonial figures and their differing approaches towards shaping national regeneration. The course will highlight and discuss the legacy of these contestations and debates in contemporary South Asia."
  },
  {
    "courseCode": "HY3264",
    "courseName": "The Sensorium: Histories of the Senses",
    "about": "The five senses may seem like simple biological facts, but they are actually culturally constructed in specific historical contexts. Focusing on a range of cultures, we will examine the role of the senses in perception, intelligence and the functioning of the body, the mind and the soul. How could the use of a particular sense elevate or discredit one’s reputation? How was life ordered according to the senses? Drawing on a range of philosophical, scientific, literary, political and folkloric artefacts, we will consider how a history of the senses can illuminate topics as diverse as statecraft, religion, science, medicine, relationships."
  },
  {
    "courseCode": "HY3265",
    "courseName": "Researching the Past",
    "about": "This class will introduce students to the process of conducting research on historical topics. They will discuss and critique examples of publishable research, and then work independently to develop their own topics and interests. In the process students will explore different methods and approaches of historical inquiry, learn how to identify, access, and use records in the archives and in digital humanities, and produce research on their own."
  },
  {
    "courseCode": "HY3266",
    "courseName": "Gender, Emotion, and the Cold War",
    "about": "In recent decades, the Cold War has developed into an area of study not only in the fields of diplomatic history, but in social and cultural histories, as well as gender, race, and memory studies. Also, its scope is no longer limited to Europe, the Soviet Union, and the United States, but covers Asia, Latin America, and Africa. With this point in mind, this course introduces students to new developments, themes, and approaches in the studies of the Cold War, with a particular emphases on the global and comparative perspectives, as well as the studies of emotions, gender, and sexuality."
  },
  {
    "courseCode": "HY3268",
    "courseName": "History and Things",
    "about": "This course explores things as aides towards historical thinking and as evidence in histories of Southeast Asia. Through manufactured objects it studies the material turn in history. Societies manufacture and are surrounded by things, only to be evaluated through their written accounts alone. History becomes the preserve of the literate, often failing to understand and account for the views of the written-about. This course addresses this gap by investigating things as sources of historical development. It introduces biographies of things, providing insights into their production and provenance, purpose and utility, and social life and persistence across times and spaces."
  },
  {
    "courseCode": "HY3551",
    "courseName": "FASS Undergraduate Research Opportunity",
    "about": "A UROP involves the student working with a supervisor, and usually in a team, on an existing research project. It has relevance to the student's Major, and involves the application of subject knowledge, methodology and theory in reflection upon the research project. UROPs usually take place within FASS, ARI, and partners within NUS, though a few involve international partners. All are vetted and approved by the Major department. All are assessed. UROPs can be proposed by supervisor or student, and require the approval of the Major department."
  },
  {
    "courseCode": "HY3551R",
    "courseName": "FASS Undergraduate Research Opportunity",
    "about": "This is a UROP course enhanced with the Research Experience Programme, where students attend seminars and workshops, access writing consultations, receive a grant to do independent research, and present their findings at a conference."
  },
  {
    "courseCode": "HY3880",
    "courseName": "Topics in History",
    "about": "This course offers an inter-disciplinary approach to the study of history. It enables students to engage in the study of history by interacting with the methods and genres of other disciplines in the humanities, notably literature and philosophy."
  },
  {
    "courseCode": "HY4205",
    "courseName": "Early Modern Europe and its World",
    "about": "This course is open to all Honours students and no previous background in either early modern or European history is required. The objective of this document-based, seminar-style course is to sharpen student's thinking skills and sense of conceptual evolution. Key concepts, such as \"sovereignty\" and the \"just war\" that remain pertinent until today will stand at the forefront of our investigations."
  }
]