[
  {
    "courseCode": "HY4229HM",
    "courseName": "Biography and History",
    "about": "This course will expose students to the historiographically complex relationship between history and biography, and its ramifications for historical writing. Students will be given opportunities to closely consider a wide range of biographies and biographical material and develop their individual sensibilities as to if, and if so, how biographical material can be used in historical construction."
  },
  {
    "courseCode": "HY4230",
    "courseName": "Historiography and Historical Method",
    "about": "The objective of this course is to introduce Honours students to the emergence of the discipline of history. The history of history will also be used to convey some of the key historiographic and theoretical issues which shape contemporary historical writing. Major topics will include: philosophies of history, professionalization, traditional history, metahistory and postmodernism. Finally, Honours students will explore different methodologies."
  },
  {
    "courseCode": "HY4230HM",
    "courseName": "Historiography and Historical Method",
    "about": "The objective of this course is to introduce Honours students to the emergence of the discipline of history. The history of history will also be used to convey some of the key historiographic and theoretical issues which shape contemporary historical writing. Major topics will include: philosophies of history, professionalization, traditional history, metahistory and postmodernism. Finally, Honours students will explore different methodologies."
  },
  {
    "courseCode": "HY4231",
    "courseName": "Family-State Relations in Chinese History",
    "about": "People today tend to see the family and the state as two separate spheres with clear boundaries — private sphere and public sphere. In Chinese tradition, the family and the state are, however, inherently connected. Arranged on a chronological and thematic basis, this course provides students an opportunity to survey the development of family‐state relations in Chinese history from the ancient to the modern eras. It examines how different teachings—such as Confucianism and Buddhism—significantly defined family‐state relations and how the popular culture — such as dramas and novels — represented and reshaped these relations over time."
  },
  {
    "courseCode": "HY4231HM",
    "courseName": "Family-State Relations in Chinese History",
    "about": "People today tend to see the family and the state as two separate spheres with clear boundaries — private sphere and public sphere. In Chinese tradition, the family and the state are, however, inherently connected. Arranged on a chronological and thematic basis, this course provides students an opportunity to survey the development of family‐state relations in Chinese history from the ancient to the modern eras. It examines how different teachings—such as Confucianism and Buddhism—significantly defined family‐state relations and how the popular culture — such as dramas and novels — represented and reshaped these relations over time."
  },
  {
    "courseCode": "HY4233",
    "courseName": "Japanese Colonialism and Imperialism",
    "about": "Japanese imperialism left a deep and lasting imprint throughout Asia. This course will examine the characteristics of the Japanese empire and its postwar legacies, as well as the diverse issues surrounding its history and memory. The primary focus of the course will be a consideration of the Japanese empire in international contexts. Students are encouraged to apply comparative perspectives to draw implications for a larger discussion on modern imperialism."
  },
  {
    "courseCode": "HY4233HM",
    "courseName": "Japanese Colonialism and Imperialism",
    "about": "Japanese imperialism left a deep and lasting imprint throughout Asia. This course will examine the characteristics of the Japanese empire and its postwar legacies, as well as the diverse issues surrounding its history and memory. The focus of the course will be reading various primary sources and fostering analytical synthesis and argumentation. Students are encouraged to apply comparative perspectives to draw implications for a larger discussion on modern imperialism."
  },
  {
    "courseCode": "HY4234",
    "courseName": "Grand Strategy in Peace and War",
    "about": "This course examines the meaning of the concept “grand strategy,” and its relationship to statecraft. Attention is paid to the ways in which historical personalities thought about power and defined priorities, as well as the manner in which these actors developed, mobilized, and exploited an array of resources and measures to advance specific goals. Their successes and failures will be evaluated, and some principles about grand strategy will be drawn from the study of historical cases."
  },
  {
    "courseCode": "HY4234HM",
    "courseName": "Grand Strategy in Peace and War",
    "about": "This course examines the meaning of the concept “grand strategy,” and its relationship to statecraft. Attention is paid to the ways in which historical personalities thought about power and defined priorities, as well as the manner in which these actors developed, mobilized, and exploited an array of resources and measures to advance specific goals. Their successes and failures will be evaluated, and some principles about grand strategy will be drawn from the study of historical cases."
  },
  {
    "courseCode": "HY4235",
    "courseName": "A History of the 20th Century and Beyond",
    "about": "This course introduces students to new developments, approaches, and themes in the study of global and international history of the 20th and 21st centuries. Depending on the instructor, the course focuses on major issues in international history, such as empire and colonialism, total war and revolution, or decolonization and the Cold War. This course is designed for 4th -year students majoring in History and aims to expose students to new arenas of research, helping them to prepare for their own research."
  }
]