[
  {
    "courseCode": "HY4241HM",
    "courseName": "Early Chinese Historiography",
    "about": "This course will explore the foundational works of China’s long historiographical tradition, focusing on the Zuo zhuan (Zuo commentary) and Sima Qian’s Shiji (Records of the Grand Scribe), which together established the models for all subsequent acts of historical writing in China. Through close reading of selected passages from these two works, students will come to appreciate the conventions, literary devices, and motivations that underlay them, and better understand the roles that source selection, narrative construction, and critical evaluation of evidentiary sources played in their creation."
  },
  {
    "courseCode": "HY4242",
    "courseName": "The History of Evil",
    "about": "This course examines changing discourses on evil from the eighteenth century to the aftermath of World War II. It explores shifts and developments in literary portrayals of the devil, varieties of theodicy, and theories about the nature of human destructiveness, criminality, and the psychology of perpetrators of evil. Through a close reading of major works in philosophy, literature, and other disciplines, we will pay attention to how understandings of evil have changed over time in response to large scale socio-cultural transformations and traumatic historical events, such as the Lisbon Earthquake of 1755 and the Holocaust."
  },
  {
    "courseCode": "HY4242HM",
    "courseName": "The History of Evil",
    "about": "This course examines changing discourses on evil from the eighteenth century to the aftermath of World War II. It explores shifts and developments in literary portrayals of the devil, varieties of theodicy, and theories about the nature of human destructiveness, criminality, and the psychology of perpetrators of evil. Through a close reading of major works in philosophy, literature, and other disciplines, we will pay attention to how understandings of evil have changed over time in response to large scale socio-cultural transformations and traumatic historical events, such as the Lisbon Earthquake of 1755 and the Holocaust."
  },
  {
    "courseCode": "HY4401",
    "courseName": "Honours Thesis",
    "about": "Honours students in History are required to produce an original piece of historical research based on primary and secondary sources. Students select and develop research topics with the approval and guidance of the History Department. Students are assigned thesis advisors who provide guidance in conducting research and writing up research materials."
  },
  {
    "courseCode": "HY4401HM",
    "courseName": "Honours Thesis",
    "about": "Honours students in History are required to produce an original piece of historical research based on primary and secondary sources. Students select and develop research topics with the approval and guidance of the History Department. Students are assigned thesis advisors who provide guidance in conducting research and writing up research materials."
  },
  {
    "courseCode": "HY4660",
    "courseName": "Independent Study",
    "about": "The Independent Study Course is designed to enable the student to explore an approved topic within the discipline in depth. The student should approach a lecturer to work out an agreed topic, readings, and assignments for the course. A formal, written agreement is to be drawn up, giving a clear account of the topic, programme of study, assignments, evaluation, and other pertinent details. Head's and/or Honours Coordinator's approval of the written agreement is required. Regular meetings and reports are expected. Evaluation is based on 100% Continuous Assessment and must be worked out between the student and the lecturer prior to seeking departmental approval."
  },
  {
    "courseCode": "HY4660HM",
    "courseName": "Independent Study",
    "about": "The Independent Study Course is designed to enable the student to explore an approved topic within the discipline in depth. The student should approach a lecturer to work out an agreed topic, readings, and assignments for the course. A formal, written agreement is to be drawn up, giving a clear account of the topic, programme of study, assignments, evaluation, and other pertinent details. Head's and/or Honours Coordinator's approval of the written agreement is required. Regular meetings and reports are expected. Evaluation is based on 100% Continuous Assessment and must be worked out between the student and the lecturer prior to seeking departmental approval."
  },
  {
    "courseCode": "HY4880",
    "courseName": "Topics in History",
    "about": "This course will examine specialised topics in history at an advanced level depending on the specialty of the instructor. The topics offered will generally be more specialised in scope than the Department's already existing course. Most likely the topic will change from year to year."
  },
  {
    "courseCode": "HY4880B",
    "courseName": "Student Movements in Asia Since 1950",
    "about": "Students have been a potent force for social and political change in many parts of Asia, particularly since 1950. Arranged on a chronological and thematic basis, this course will give students an opportunity to survey the history of student activism, primarily but not exclusively, in Asian countries during this period. In emphasizing a comparative approach, the course not only looks into the causes, functions, effects, and limits of student movements in each society, but also explores intra‐Asian, or even global, interconnections of student activism in the second half of the twentieth century."
  },
  {
    "courseCode": "HY4880BHM",
    "courseName": "Student Movements in Asia Since 1950",
    "about": "Students have been a potent force for social and political change in many parts of Asia, particularly since 1950. Arranged on a chronological and thematic basis, this course will give students an opportunity to survey the history of student activism, primarily but not exclusively, in Asian countries during this period. In emphasizing a comparative approach, the course not only looks into the causes, functions, effects, and limits of student movements in each society, but also explores intra‐Asian, or even global, interconnections of student activism in the second half of the twentieth century."
  }
]