[
  {
    "courseCode": "HY4880HM",
    "courseName": "Topics in History",
    "about": "This course will examine specialised topics in history at an advanced level depending on the specialty of the instructor. The topics offered will generally be more specialised in scope than the Department's already existing course. Most likely the topic will change from year to year."
  },
  {
    "courseCode": "HY5207",
    "courseName": "Approaches to American History",
    "about": "This graduate seminar introduces students to major topics and approaches in American history and historiography. The precise themes and subjects taught in this course vary by semester and instructor. Please refer to the course syllabus for more information."
  },
  {
    "courseCode": "HY5208",
    "courseName": "Approaches to Modern European History",
    "about": "This course will examine the major approaches to the study of modern European (19th-20th centuries) history in order to equip graduate students at the MA level with the major historiographic trends which have shaped research into the subject. To that end, the course will introduce students to the most significant approaches in political, economic, diplomatic, cultural, gender, social, religious and intellectual history which have shaped the existing scholarship."
  },
  {
    "courseCode": "HY5210",
    "courseName": "Approaches to Modern Se Asian History",
    "about": "This course is designed to introduce graduate students to the major themes and issues that make up the chronological field of \"modern Southeast Asian history\". A comprehensive study of secondary literature for the period as well as seminal works in Anthropology and Political Science will prepare students with the necessary training before embarking on their own research projects. Topics covered will include: modernity/traditionalism, constructing chronologies, colonialism, nationalism, rebellion/resistance, nation-building, the Japanese in WWII, the role of the Army/Communists, post-colonial critiques, border tensions, migration, and religion."
  },
  {
    "courseCode": "HY5210R",
    "courseName": "Approaches to Modern Se Asian History",
    "about": "This course is designed to introduce graduate students to the major themes and issues that make up the chronological field of \"modern Southeast Asian history\". A comprehensive study of secondary literature for the period as well as seminal works in Anthropology and Political Science will prepare students with the necessary training before embarking on their own research projects. Topics covered will include: modernity/traditionalism, constructing chronologies, colonialism, nationalism, rebellion/resistance, nation-building, the Japanese in WWII, the role of the Army/Communists, post-colonial critiques, border tensions, migration, and religion."
  },
  {
    "courseCode": "HY5211",
    "courseName": "Approaches to Modern East Asian History",
    "about": "This course examines the political, economic, social, cultural, racial, and military histories of China, Japan and Korea over the course of the twentieth and outset of the twenty first centuries. Special attention will be paid to the interaction among these different national histories, as well as the influence of other regional actors, such as the United States and Soviet Union."
  },
  {
    "courseCode": "HY5301",
    "courseName": "Internship in History",
    "about": "It aims to provide students with practical professional experience involving at least ten weeks in an archive, museum, historical library, or the heritage business. The hosting institution in collaboration with the Department will define the workscope of students on internship. Students are required to submit a project, the topic of which must be approved in advance, together with a 3000-word report on the internship experience at the end of the work period. The student is required to spend three hours three days per week for a total of ten weeks at the hosting institution."
  },
  {
    "courseCode": "HY5302",
    "courseName": "Approaches to Military History",
    "about": "Military history is one of the most dynamic fields in the subject, focal point for controversies ranging from what historians should be studying to how they should see history per se. The traditional focus on operations, command and strategy now co-exists with the no longer ?new? military history that is more interested in the impact of warfare on society and culture, militarism and its effect on politics, the relationship between military institutions and economies, and issues of race and nationality in the military experience. This course will introduce graduate students to the methodologies and controversies of a field that crosses all regional and national boundaries in history. An important component will be the bibliographical project, training students to develop their own grasp of the literature that must be mastered."
  },
  {
    "courseCode": "HY5303",
    "courseName": "Problems in Cultural History",
    "about": "This course aims to introduce graduate students to cultural history as a distinct sub-discipline within historical studies. In each session, the course will structured around a theme (eg, 'Culture and imperialism', 'Power, Status and Charisma') to allow the student to both learn about the methodology of cultural historians and how this field fits into the broader study of history."
  },
  {
    "courseCode": "HY5303R",
    "courseName": "Problems in Cultural History",
    "about": "This course aims to introduce graduate students to cultural history as a distinct sub-discipline within historical studies. In each session, the course will structured around a theme (eg, 'Culture and imperialism', 'Power, Status and Charisma') to allow the student to both learn about the methodology of cultural historians and how this field fits into the broader study of history."
  }
]