[
  {
    "courseCode": "HY5304",
    "courseName": "Imperialism & Empires: Historical Approaches",
    "about": "Imperialism and Empires are two historical developments that no scholars of modern world, political, international, cultural, social, economic and military history ever ignore. Imperialism remains one of the most hotly debated historical forces in the discipline and has been approached by nearly every different methodology and perspective that academic historians have explored in the last century. This course will introduce graduate students to the approaches to a field that crosses all boundaries in the study of history. An important component will be the bibliography project, training students to develop their own grasp of the literature they must master."
  },
  {
    "courseCode": "HY5304R",
    "courseName": "Imperialism & Empires: Historical Approaches",
    "about": "Imperialism and Empires are two historical developments that no scholars of modern world, political, international, cultural, social, economic and military history ever ignore. Imperialism remains one of the most hotly debated historical forces in the discipline and has been approached by nearly every different methodology and perspective that academic historians have explored in the last century. This course will introduce graduate students to the approaches to a field that crosses all boundaries in the study of history. An important component will be the bibliography project, training students to develop their own grasp of the literature they must master."
  },
  {
    "courseCode": "HY5305",
    "courseName": "Approaches to World History",
    "about": "This course examines major themes, methodologies and scholarship in the rapidly developing field of world history. Depending on the instructor, the content of the course might focus on specific topics such as immigration, trans-imperial trade, or frontier studies. As special emphasis is placed on the integration of particular regions into global systems and networks, this course will be especially useful for helping students to locate the significance of their own research in a larger context."
  },
  {
    "courseCode": "HY5305R",
    "courseName": "Approaches to World History",
    "about": "This course examines major themes, methodologies and scholarship in the rapidly developing field of world history. Depending on the instructor, the content of the course might focus on specific topics such as immigration, trans-imperial trade, or frontier studies. As special emphasis is placed on the integration of particular regions into global systems and networks, this course will be especially useful for helping students to locate the significance of their own research in a larger context."
  },
  {
    "courseCode": "HY5401",
    "courseName": "Historiography On China",
    "about": "This graduate course examines the history of history writings on China, turning the pool of extant secondary publications into a primary source of analysis. Certain major authors and their works will be highlighted, with attention paid to inter-disciplinary approaches. Their selection is aimed at achieving a broad coverage of the various streams of traditional Chinese historiography, Chinese Marxist writings and Western historical analyses. The reading and writing of book reviews and literature surveys are integral parts of this course."
  },
  {
    "courseCode": "HY5401R",
    "courseName": "Historiography On China",
    "about": "This graduate course examines the history of history writings on China, turning the pool of extant secondary publications into a primary source of analysis. Certain major authors and their works will be highlighted, with attention paid to inter-disciplinary approaches. Their selection is aimed at achieving a broad coverage of the various streams of traditional Chinese historiography, Chinese Marxist writings and Western historical analyses. The reading and writing of book reviews and literature surveys are integral parts of this course."
  },
  {
    "courseCode": "HY5402",
    "courseName": "Reconsidering the Cold War",
    "about": "In recent decades, the Cold War has developed into an area of study not only in the fields of diplomatic history and international relations, but in social and cultural history, literature and film, design and art, and rhetoric and communications studies. This seminar introduces students to new developments, themes, and approaches in the study of the Cold War through exploring such diverse topics as colonialism and anti-colonialism, cultural diplomacy, Cold War culture, domestic purges, social protest, decolonization, developmentalism, and \"neo-colonialism.\" It aims to expose students to new arenas of research, helping them to prepare for their own research."
  },
  {
    "courseCode": "HY5402R",
    "courseName": "Reconsidering the Cold War",
    "about": "In recent decades, the Cold War has developed into an area of study not only in the fields of diplomatic history and international relations, but in social and cultural history, literature and film, design and art, and rhetoric and communications studies. This seminar introduces students to new developments, themes, and approaches in the study of the Cold War through exploring such diverse topics as colonialism and anti-colonialism, cultural diplomacy, Cold War culture, domestic purges, social protest, decolonization, developmentalism, and \"neo-colonialism.\" It aims to expose students to new arenas of research, helping them to prepare for their own research."
  },
  {
    "courseCode": "HY5403",
    "courseName": "Interpreters of Southeast Asian Pasts",
    "about": "The notion of Southeast Asia continues to be a site of contestation. In this course, students will be encouraged to imaginatively wade into an ongoing conversation as the latest in a long line of interpreters – mythic, historical and contemporary – of Southeast Asian pasts. Students will encounter a wide range of texts and discover how differing contexts, worldviews, theories, methods and source materials have been creatively and imaginatively used to both question and enrich understandings of Southeast Asian pasts. Each iteration of this course will focus on a specific region in Southeast Asia, depending on the expertise of the instructor."
  },
  {
    "courseCode": "HY5405",
    "courseName": "Applied and Public History: Theory, Method and Practice",
    "about": "This course introduces students to the theories and practices of applied and public history. It examines the development and evolution of the field; the major theoretical debates; and exemplary examples of how history has been applied to educate, entertain, offer perspective to current problems, and resolve realworld issues."
  }
]