[
  {
    "courseCode": "HY5406",
    "courseName": "Archives and Knowledge of the Past",
    "about": "This course critically examines “the archive.” It explores the various ways in which the archive has been defined. It investigates why and how some knowledges about the past are collected, preserved, and recovered, and why and how some are not collected, preserved, and recovered. The class will also study the extent of the authority that the archive holds and wields over interpretations of the past."
  },
  {
    "courseCode": "HY5407",
    "courseName": "Theory and Practice of Oral History",
    "about": "This course examines the craft and tools of the oral historian. It explores the key theoretical ideas developed in oral history scholarship; the methods used to collect oral histories; the variety of approaches to interpret oral sources; and the ethics of oral history collection. Students reading this course will be equipped with the tools to develop, undertake, transcribe, and critically analyze an oral history interview."
  },
  {
    "courseCode": "HY5408",
    "courseName": "History and Memory",
    "about": "This course examines the major themes in the study of history and memory. It addresses questions about the importance of investigating memory, its construction, its production, and its impact on personal and group identities, popular understandings of the past, and national identity. Topics explored include the relationship and tension between historical research and memory; individual and collective memories; the politics of memory; and memorial practices. The class will also examine the memory industry and the business of memorialization."
  },
  {
    "courseCode": "HY5408R",
    "courseName": "History and Memory",
    "about": "This course examines the major themes in the study of history and memory. It addresses questions about the importance of investigating memory, its construction, its production, and its impact on personal and group identities, popular understandings of the past, and national identity. Topics explored include the relationship and tension between historical research and memory; individual and collective memories; the politics of memory; and memorial practices. The class will also examine the memory industry and the business of memorialization."
  },
  {
    "courseCode": "HY5409",
    "courseName": "Museums and Museology: Critical Perspectives",
    "about": "This course explores the key theoretical debates and methodological approaches to the study of museums. It equips students with the capacities to understand what a museum is and does. It also offers critical perspectives on what a museum can be. The range of topics to be covered include the history and development of museums in diverse cultural and sociopolitical contexts; the purpose and functions of museums; the strategies of collection; and the ordering of collections and knowledge."
  },
  {
    "courseCode": "HY5410",
    "courseName": "Historical Reasoning: The Past and Decision-Making",
    "about": "This course is about the use of history for decision making. It examines the ways decision-makers employ historical analogies and narratives about the past to make sense of contemporary affairs or solve problems. It explores how history can be abused or misused. The course also presents ways on how history can be better employed to reason and make decisions."
  },
  {
    "courseCode": "HY5411",
    "courseName": "Special Topics in Applied and Public History",
    "about": "This course explores topics of special interest in applied and public history. It is offered by regular or visiting faculty members. The specific topics to be covered will depend on the instructional and research interests of the faculty member."
  },
  {
    "courseCode": "HY5412",
    "courseName": "Studying Singaporean History",
    "about": "This course acquaints graduate students with the field of Singaporean history. Seminar students will read, critique and discuss the analytical and methodological approaches, historiographical debates, key questions, research agendas, and major trends contained in key articles and books on Singaporean history in order to gain a deeper understanding of how the past, and writing about it, has shaped our understanding of our history."
  },
  {
    "courseCode": "HY5413",
    "courseName": "Special Topics in Asian and Global History",
    "about": "This course explores topics of special interest in Asian and global history. It is offered by regular or visiting faculty members. The specific topics to be covered will depend on the instructional and research interests of the faculty member."
  },
  {
    "courseCode": "HY5414",
    "courseName": "Master's Thesis (Coursework Program)",
    "about": "Students select research topics with the guidance and approval of the Department of History. They are assigned supervisors who will guide them in conducting research and writing a 10,000-word thesis."
  }
]