[
  {
    "courseCode": "HY5415",
    "courseName": "Theatres of Memory: Performing Public History",
    "about": "This course surveys how societies gain new understandings of the past through performances in the public sphere. A broad spectrum of performances across various cultural contexts will be explored, including theatre and dance, historical re-enactments, public rituals, immersive exhibitions, films, and digital sites such as video games and social media. This course equips students with a toolkit with which to interpret, analyse, and reflect on the dramaturgical strategies and techniques that shape the stories told in these performances, examining how they enhance historical consciousness and negotiate the distance between past and present for the communities involved."
  },
  {
    "courseCode": "HY5416",
    "courseName": "The United States and Asia",
    "about": "This course explores topics of special interest in the study of the history of U.S. foreign relations with Asia. It addresses the origins, nature, and outcomes of the American interventions and involvement in the region. It also discusses the multiple approaches scholars employ to investigate and explain the history of U.S.-Asia relations. Candidates will be trained and equipped with the analytical tools to critique the approaches and undertake independent research of the subject."
  },
  {
    "courseCode": "HY5417",
    "courseName": "Contested Sites: Built Heritage and Historical Memory",
    "about": "This course will focus on the ways certain monuments have become sites of contestation. From conflicts over religious monuments, to the statue-toppling protests of recent years, to the attacks on ancient historical structures by groups like the Taliban and Islamic State, built heritage embodies ideas and beliefs about social norms, belonging ideals and divine presence, for some, whilst signalling oppression, absence, exclusion and loss for others. Through a series of case studies, students will learn the complex histories of certain sites and the range of actions that various interest groups have taken to ‘resolve’ the conflicts."
  },
  {
    "courseCode": "HY5418",
    "courseName": "Comparative Business History",
    "about": "This course takes a comparative approach to business history by examining the role of entrepreneurship and firms in shaping global capitalism since World War II. Using case studies, Part I examines how entrepreneurs and businesses rebuilt global capitalism and markets after the War. Part II focuses on the creation of the ‘new global economy’ since the 1980s, looking at emerging markets, especially India and China. Placing business in political, economic and cultural context the course emphasises how national and regional diversity coexists within a globalizing economy. It also highlights the contrasting pathways of capitalist development which different national economies follow."
  },
  {
    "courseCode": "HY5419",
    "courseName": "Digital History: Theory and Practice",
    "about": "Digital technologies and methods have opened new possibilities for historians. This course explores the field of digital history, its theoretical debates and its practical implications. We will survey the different types of digital historical data, consider the process and ethics of digitisation, and debate the merits and limitations of methods like crowdsourced research and machine learning. You will have the opportunity to experiment with a variety of digital tools, and to create your own digital history project. No prior experience in digital history or in computing is required for this course; students with any level of digital literacy are welcome."
  },
  {
    "courseCode": "HY5420",
    "courseName": "Rethinking Cold War Asia",
    "about": "What’s noteworthy in recent Cold War historiography is that the focus of questions has shifted from the Cold War’s origins to its nature. The key question is no longer simply “Who began it?” but more “What was it?” and “How do we approach it?” Also, the focus is no longer limited to Europe and the U.S. With these points in mind, this seminar introduces students to new developments and approaches in the studies of the Cold War, with a particular focus on Asia. It aims to expose students to new arenas of research, helping them prepare for their own research."
  },
  {
    "courseCode": "HY5421",
    "courseName": "The Philosophy of History",
    "about": "Through an engagement with foundational texts from the eighteenth century to the present, this course explores the emergence and development of modern philosophies of history. It grapples with such issues as the meaning of history, the problem of human agency, the relationship between history and nature, and the status of historical knowledge. Students will learn about the diverse ways in which the past has been represented, narrated, and interpreted; they will also examine how philosophical theorizations and interpretations of the past are themselves imbedded in specific historical contexts."
  },
  {
    "courseCode": "HY5422",
    "courseName": "Time and Space: Doing History with GIS",
    "about": "This course is a practical introduction to using geographic information system (GIS) technologies to address historical questions and to visualise historical knowledge and research. We will discuss the principles of spatial history and GIS, and explore how the past can be represented through historical GIS datasets. You will have the opportunity to create and to work with historical GIS data, to make map visualisations, and to explore how you can use GIS to drive historical inquiry. No prior experience in digital history or in computing is required for this course; students with any level of digital literacy are welcome."
  },
  {
    "courseCode": "HY5660",
    "courseName": "Independent Study",
    "about": "Independent research plays an important role in graduate education. The Independent Study Course is designed to enable the student to explore an approved topic in History in depth. The student should approach a lecturer to work out an agreed topic, readings, and assignments for the course. A formal, written agreement is to be drawn up, giving a clear account of the topic, number of contact hours, assignments, evaluation, and other pertinent details. Head's and/or Graduate Coordinator's approval is required. Regular meetings and reports are expected. Evaluation is based on 100% Continuous Assessment and must be worked out between the student and the lecturer prior to seeking departmental approval."
  },
  {
    "courseCode": "HY6101",
    "courseName": "Historiography: Theory & Archive",
    "about": "This course will enable graduate students to make use of a wide range of contemporary historical methods. The focus will be on major historians, current debate about historical practice, theoretical history and historical interpretation. Students will be strongly encouraged to explore the challenges inherent in connecting archival study with theoretical methodologies."
  }
]