[
  {
    "courseCode": "HY6204",
    "courseName": "Directed Studies: Selected Areas",
    "about": "These courses with deal with close reading and analysis of secondary works [and primary research on selected topics] in a select area of history. Students should choose an area that is related to their proposed dissertation. Each student who offers this course will be assigned a mentor who will help identify the key works in a particular area and guide in the critical readings of these works. Such directed studies courses will provide students with constant instruction and exposure to the subject."
  },
  {
    "courseCode": "HY6205",
    "courseName": "Special Topics in History and Historiography",
    "about": "SPECIAL TOPICS IN HISTORY AND HISTORIOGRAPHY"
  },
  {
    "courseCode": "HY6206",
    "courseName": "Community Formation in Se Asia",
    "about": "The course will focus on different types of identity or community different modes of belonging which have operated, or are likely to operate, in Southeast Asia. Discussion will cover the nation state, diasporic, ethnic, family, religious, gender, security, trading and other communities in the region. We will also give attention to regionalism particularly the sentiment that underpins the ASEAN and East Asian regional project"
  },
  {
    "courseCode": "HY6401",
    "courseName": "Southeast Asian Historiography",
    "about": "This course surveys the various approaches that were developed to study and conceptualise Southeast Asian history. It seeks to equip students with an awareness of the analytical frameworks within which history research on the region had been written up. In the process, the course will evaluate the validity of the different approaches. For illustration, samples from secondary literature and, where applicable, primary texts will be used."
  },
  {
    "courseCode": "HY6402",
    "courseName": "The Historian's Craft",
    "about": "This course will provide intensive training in research and writing of history. lt will begin with methodological discussions on the writing of history and examples and critiques of different techniques and formats. During this time, each student will be composing a research paper of article length and publishable quality on a topic related to his or her own research. The final weeks of class will be dedicated to intense reading and critique of the student papers by their peers."
  },
  {
    "courseCode": "HY6660",
    "courseName": "Independent Study",
    "about": "Independent research plays an important role in graduate education. The Independent Study Course is designed to enable the student to explore an approved topic in History in depth. The student should approach a lecturer to work out an agreed topic, readings, and assignments for the course. A formal, written agreement is to be drawn up, giving a clear account of the topic, number of contact hours, assignments, evaluation, and other pertinent details. Head's and/or Graduate Coordinator's approval is required. Regular meetings and reports are expected. Evaluation is based on 100% Continuous Assessment and must be worked out between the student and the lecturer prior to seeking departmental approval."
  },
  {
    "courseCode": "HY6770",
    "courseName": "Graduate Research Seminar",
    "about": "This is a required course for all research Masters and PhD students admitted from AY2004/2005. The course provides a forum for students and faculty to share their research and to engage one another critically in discussion of their current research projects. The course will include presentations by faculty on research ethics and dissertation writing. Each student is required to present a formal research paper. Active participation in all research presentations is expected. The course may be spread over two semesters and will be graded \"Satisfactory/Unsatisfactory\" on the basis of student presentation and participation."
  },
  {
    "courseCode": "HY6881",
    "courseName": "Topics in Southeast Asian History",
    "about": "This course will evaluate specific topics in Southeast Asian history depending on the specialty of the instructor. One of the main goals is to help the students develop a bibliography, from which they will develop research papers that will be related to dissertation topics. Thus, the goal is to provide doctoral candidates with the tools to conduct research in the region, while also introducing them to the current state of historical research in Southeast Asia."
  },
  {
    "courseCode": "HY6882",
    "courseName": "Topics in Chinese History",
    "about": "This course is both historiographical and research-oriented. Each iteration examines a different set of historical topics. The course introduces students to key themes in the scholarship on the topics of the instructor’s choice and familiarizes them with the relevant primary source materials. Students will engage critically with the debates which have defined the field and explore a range of methodological and disciplinary approaches. They are also expected to identify and pursue a relevant research interest throughout the semester."
  },
  {
    "courseCode": "PE1741E",
    "courseName": "Department Exchange Course",
    "about": "Not Available"
  }
]