[
  {
    "courseCode": "SSA2211",
    "courseName": "The Evolution of a Global City-State",
    "about": "Histories of Singapore have conventionally been narrated along internal lines, framed by administrative, political and national trajectories. Yet, the evolution of Singapore, from regional emporium to imperial port and strategic naval base, has all along been defined by much larger regional and transoceanic forces. Even after political independence in 1965, Singapore continues to project itself as a 'global city-state'. This module seeks to examine the historical evolution of Singapore against the contexts of global changes and developments from the 14th to the 21st century. This module is open to all students interested in Singapore studies."
  },
  {
    "courseCode": "SSA2220",
    "courseName": "Global Economic Dimensions of Singapore",
    "about": "This course will introduce students to the dynamics of the world economy and the impact on Singapore in the last two centuries. It will demonstrate how Singapore grew through continual dependence on the rest of the world in different ways by focusing on major labour, capital and technological factors, in which threats are also seen as opportunities."
  },
  {
    "courseCode": "SSA2221",
    "courseName": "Popular Culture in Singapore",
    "about": "Popular Culture in Singapore is designed for both History and non-History students to look at the development of popular culture in Singapore from the colonial period to the present day. By learning about street theatre, local films, and theme parks among others, students will explore thematic issues like diasporic, immigrant and cosmopolitan communities; colonial impact; stratification of society by class, race and religion; surveillance; gender and the body; family and social spaces (theme parks, social clubs, sports fields). Students are expected to gain a sensitivity to historical contexts, and to better understand Singapores rich cultural heritage what has been lost, what has been recovered, the politics of heritage as well as the political, social and economic realities in Singapores historical trajectory."
  },
  {
    "courseCode": "UTOA2001HY",
    "courseName": "Undergraduate Teaching Opportunities Programme (UTOP)",
    "about": "UTOP aims to train undergraduates to acquire and promulgate “teaching” skills. When pursuing such traineeship in teaching under UTOP, students can develop their teaching skills in a more systematic manner, and become better equipped when reaching out to those who need their help and guidance. The objective is to ensure these UTOP trainees do their good deeds (e.g., giving free tuition) in an effective manner, and more importantly, with good aptitude and confidence."
  },
  {
    "courseCode": "UTOA2002HY",
    "courseName": "Undergraduate Teaching Opportunities Programme (UTOP)",
    "about": "UTOP aims to train undergraduates to acquire and promulgate “teaching” skills. When pursuing such traineeship in teaching under UTOP, students can develop their teaching skills in a more systematic manner, and become better equipped when reaching out to those who need their help and guidance. The objective is to ensure these UTOP trainees do their good deeds (e.g., giving free tuition) in an effective manner, and more importantly, with good aptitude and confidence."
  },
  {
    "courseCode": "UTOA2201HY",
    "courseName": "Undergraduate Teaching Opportunities Programme (UTOP)",
    "about": "UTOP aims to train undergraduates to acquire and promulgate “teaching” skills. When pursuing such traineeship in teaching under UTOP, students can develop their teaching skills in a more systematic manner, and become better equipped when reaching out to those who need their help and guidance. The objective is to ensure these UTOP trainees do their good deeds (e.g., giving free tuition) in an effective manner, and more importantly, with good aptitude and confidence."
  },
  {
    "courseCode": "XFA4401",
    "courseName": "Integrated Honours Project",
    "about": "For this course which is applicable to the double honours degree programmes, students are required to write a scholarly report of not more than 40 typed pages (including bibliography and appendices) on a rigorous multi-disciplinary research on current issues, or on theory or methodology."
  },
  {
    "courseCode": "XFA4402",
    "courseName": "Integrated Honours Thesis",
    "about": "For this course which is applicable to the double honours degree programmes, students are required to write a scholarly report of not more than 40 typed pages (including bibliography and appendices) on a rigorous multi‐disciplinary research on current issues, or on theory or methodology."
  },
  {
    "courseCode": "XFA4406",
    "courseName": "Integrated Honours Thesis",
    "about": "This module allows Economics/Computing double degree students to write an honours thesis that integrates their two areas of study—Economics and Business Analytics/Information Systems. Students taking this module must conduct an independent research project on an approved topic under the supervision of two faculty members (one from Economics and one from the School of Computing)."
  },
  {
    "courseCode": "XFA4408",
    "courseName": "Integrated Honours Thesis",
    "about": "This course allows Economics/Mathematics or Applied Mathematics double degree students to write an honours thesis that integrates their two areas of study — Economics and Mathematics/Applied Mathematics. Students taking this course must conduct an independent research project and write a scholarly report of not more than 40 typed pages (including bibliography and appendices) on a rigorous multi‐disciplinary research on an approved topic under the supervision of two faculty members (one from Economics and one from the Department of Mathematics)."
  }
]