[
  {
    "courseCode": "XFA4411",
    "courseName": "Integrated Honours Thesis",
    "about": "For this course which is applicable to the double honours degree programmes, students are required to write a scholarly report on a rigorous multi‐disciplinary research on current issues, or on theory or methodology."
  },
  {
    "courseCode": "XFA4413",
    "courseName": "Integrated Honours Thesis",
    "about": "For this course which is applicable to the double honours degree programmes, students are required to write a scholarly report of not more than 40 typed pages (including bibliography and appendices) on a rigorous multi‐disciplinary research on current issues, or on theory or methodology."
  },
  {
    "courseCode": "XFA4414",
    "courseName": "Integrated Honours Thesis",
    "about": "This course allows Economics/Computing double degree students to write an honours thesis that integrates their two areas of study—Economics and Business Analytics. Students taking this course must conduct an independent research project on an approved topic under the supervision of two faculty members (one from Economics and one from the School of Computing)."
  },
  {
    "courseCode": "XFA4415",
    "courseName": "Integrated Honours Thesis",
    "about": "This course allows Economics/Computing double degree students to write an honours thesis that integrates their two areas of study—Economics and Information Systems. Students taking this course must conduct an independent research project on an approved topic under the supervision of two faculty members (one from Economics and one from the School of Computing)."
  },
  {
    "courseCode": "XFA4416",
    "courseName": "Integrated Honours Thesis",
    "about": "For this course which is applicable to the double honours degree programmes, students are required to write a scholarly report on a rigorous multi‐disciplinary research on current issues, or on theory or methodology."
  },
  {
    "courseCode": "XFA4417EC",
    "courseName": "Integrated Honours Thesis",
    "about": "This course allows students in a double degree programme with the Faculty of Science to write an honours thesis that integrates their two areas of study. Students taking this course must conduct an independent research project and write a scholarly report of not more than 40 typed pages (including bibliography and appendices) on a rigorous multi‐disciplinary research on an approved topic under the supervision of two faculty members (one from Economics and one from a department in the Faculty of Science."
  }
]