[
  {
    "courseCode": "EC3396",
    "courseName": "Economic Analysis of Law I",
    "about": "\"Why is there this thing called “government”? Why do we need to own stuff? Why is theft illegal? Why is it occasionally good to breach a contract?” These questions touch very distinct areas of the law. But there is one way to go about answering all of them: Economic Analysis! In this class we will show that economic efficiency is what makes a good law and that laws that don’t make sense can be critiqued with economic arguments. Law and economics is a class that expands the scope of economics and limits the arbitrariness of the law."
  },
  {
    "courseCode": "EC3551",
    "courseName": "FASS Undergraduate Research Opportunity (UROP)",
    "about": "A UROP involves the student working with a supervisor, and usually in a team, on an existing research project. It has relevance to the student's Major, and involves the application of subject knowledge, methodology and theory in reflection upon the research project. UROPs usually take place within FASS, ARI, and partners within NUS, though a few involve international partners. All are vetted and approved by the Major department. All are assessed. UROPs can be proposed by supervisor or student, and require the approval of the Major department."
  },
  {
    "courseCode": "EC3551R",
    "courseName": "FASS Undergraduate Research Opportunity (UROP)",
    "about": "This is a UROP course enhanced with the Research Experience Programme, where students attend seminars and workshops, access writing consultations, receive a grant to do independent research, and present their findings at a conference."
  },
  {
    "courseCode": "EC3880",
    "courseName": "Topics in Economics",
    "about": "This course is designed to cover selected topics in Economics. The topics to be covered will depend on the interest and expertise of regular or visiting staff member in the department."
  },
  {
    "courseCode": "EC3880A",
    "courseName": "Topics in Economics: Understanding Government",
    "about": "This course takes a multi‐disciplinary, practitionerdriven perspective to analysing government policies and actions. It does this by applying three conceptual paradigms to studying government, namely standard economics, behavioural economics and organisational psychology. The course will first examine governments through the lens of market failures and how economists have viewed the role of government. It will then examine the cognitive limits of economic agents and explore how behavioural economics offers the prospect of better policy design. In the third segment, the course explores government actions through the lens of organisational psychology, and examines how bureaucratic inertia impedes reform and innovation."
  },
  {
    "courseCode": "EC3880C",
    "courseName": "Topics in Economics: Economic History of Southeast Asia",
    "about": "This course provides a broad overview of Southeast Asian economic history from “pre-modern” times to the present day. The focus will be broad rather than narrow, and we shall devote attention both to internal developments in Southeast Asia and to the region’s long and varied engagement with other parts of the world. Some familiarity with economic concepts and with Southeast Asian history obviously will be helpful, but there are no prerequisites for the course. The course will be conducted in lecture/discussion format."
  },
  {
    "courseCode": "EC3880D",
    "courseName": "Topics in Economics: Empire, Economics, and Identity",
    "about": "This course immerses students in the economic history of Penang, and by extension, the Straits Settlements. We consider how political conflicts across the globe centuries ago explain the diaspora in Penang today. We examine the lives of different linguistic, religious, and political communities — Malays, Chinese, Chulia, Armenians, Sephardi Jews, and British — as well as the birth of hybrid identities — Baba Nyonya, Jawi Peranakan, and Eurasians. We explore how globalization enabled a few immigrants to go from rags to riches. We observe the different players — merchants, coolies, and bureaucrats. We study the interaction and evolution of labor, capital, and technology."
  },
  {
    "courseCode": "EC3880G",
    "courseName": "Topics in Economics: Introduction to Health Economics",
    "about": "This course aims to help students to understand how the demand and supply of healthcare services interact to yield market outcomes (price, quantity, and quality) in various healthcare markets, such as US, UK, Singapore, and China. Students will learn to analyse (1) the behaviour of consumers, insurers, physicians, and hospitals using basic economic frameworks; (2) the impacts of public policies in health and medical care from an economic perspective."
  },
  {
    "courseCode": "EC4301",
    "courseName": "Microeconomic Analysis III",
    "about": "The purpose of this course is to provide students with a sound understanding of modern microeconomic theory. The first half of the course introduces the fundamental tools of microeconomic analysis. It covers consumer theory, firm theory, and general equilibrium. The second half consists of introduction to a number of topics which signify the recent development in microeconomics. These topics include decisions under uncertainty and asymmetric information, and non-cooperative game theory and its applications."
  },
  {
    "courseCode": "EC4301HM",
    "courseName": "Microeconomic Analysis III",
    "about": "The purpose of this course is to provide students with a sound understanding of modern microeconomic theory. The first half of the course introduces the fundamental tools of microeconomic analysis. It covers consumer theory, firm theory, and general equilibrium. The second half consists of introduction to a number of topics which signify the recent development in microeconomics. These topics include decisions under uncertainty and asymmetric information, and non-cooperative game theory and its applications."
  }
]